ankuns/nrfx/bsp/stable/mdk/nrf7140_ml.svd
        <register>
          <name>PSR</name>
          <description>Protocol Status Register</description>
          <addressOffset>0x044</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>LEC</name>
              <description>Last Error Code</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoError</name>
                  <description>No error occurred since LEC has been reset by successful reception or transmission.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>StuffError</name>
                  <description>More than 5 equal bits in a sequence have occurred in a part of a received message
              where this is not allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FormError</name>
                  <description>A fixed format part of a received frame has the wrong format.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AckError</name>
                  <description>The message transmitted by the MCAN was not acknowledged by another node.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Bit1Error</name>
                  <description>During the transmission of a message (with the exception of the arbitration field),
              the device wanted to send a recessive level (bit of logical value 1), but the monitored bus
              value was dominant.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Bit0Error</name>
                  <description>During the transmission of a message (or acknowledge bit, or active error flag, or
              overload flag), the device wanted to send a dominant level (data or identifier bit logical value
              '0'), but the monitored bus value was recessive. During Bus_Off recovery this status is set
              each time a sequence of 11 recessive bits has been monitored. This enables the CPU to
              monitor the proceeding of the Bus_Off recovery sequence (indicating the bus is not stuck at
              dominant or continuously disturbed).</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRCError</name>
                  <description>The CRC check sum of a received message was incorrect. The CRC of an incoming
              message does not match with the CRC calculated from the received data.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NoChange</name>
                  <description>Any read access to the Protocol Status Register re-initializes the LEC to '7'.
              When the LEC shows the value '7', no CAN bus event was detected since the last CPU read
              access to the Protocol Status Register.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACT</name>
              <description>Activity</description>
              <lsb>3</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Synchronizing</name>
                  <description>Node is synchronizing on CAN communication</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Idle</name>
                  <description>Node is neither receiver nor tr ansmitter</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Receiver</name>
                  <description>Node is operating as receiver</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Transmitter</name>
                  <description>Node is operating as transmitter</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EP</name>
              <description>Error Passive</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>The MCAN is in the Error_Active state. It normally takes part in bus communication and
            sends an active error flag when an error has been detected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Passive</name>
                  <description>The MCAN is in the Error_Passive state</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EW</name>
              <description>Warning Status</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Below</name>
                  <description>Both error counters are below the Error_Warning limit of 96</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reached</name>
                  <description>At least one of error counter has reached the Error_Warning limit of 96</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BO</name>
              <description>Bus_Off Status</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>On</name>
                  <description>The MCAN is not Bus_Off</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Off</name>
                  <description>The MCAN is in Bus_Off state</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DLEC</name>
              <description>Data Phase Last Error Code</description>
              <lsb>8</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>RESI</name>
              <description>ESI flag of last received CAN FD Message</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotReceived</name>
                  <description>Last received CAN FD message did not ha ve its ESI flag set</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Received</name>
                  <description>Last received CAN FD message had its ESI flag set</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RBRS</name>
              <description>BRS flag of last received CAN FD Message</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotReceived</name>
                  <description>Last received CAN FD message did not ha ve its BRS flag set</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Received</name>
                  <description>Last received CAN FD message had its BRS flag set</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RFDF</name>
              <description>Received a CAN FD Message</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotReceived</name>
                  <description>Since this bit was reset by the CPU, no CAN FD message has been received</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Received</name>
                  <description>Message in CAN FD format with FDF flag set has been received</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PXE</name>
              <description>Protocol Exception Event</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotTriggered</name>
                  <description>No protocol exception event occurred since last read access</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Triggered</name>
                  <description>Protocol exception event occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TDCV</name>
              <description>Transmitter Delay Compensation Value</description>
              <lsb>16</lsb>
              <msb>22</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TDCR</name>
          <description>Transmitter Delay Compensation Register</description>
          <addressOffset>0x048</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TDCF</name>
              <description>Transmitter Delay Compensation Filter Window Length</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>TDCO</name>
              <description>Transmitter Delay Compensation SSP Offset</description>
              <lsb>8</lsb>
              <msb>14</msb>
            </field>
          </fields>
        </register>
