ankuns/nrfx/bsp/stable/mdk/nrf7140_ml.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GLOBAL_TSGEN</name>
      <description>Timestamp generator</description>
      <baseAddress>0xBF041000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>TSGEN</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>CNTCR</name>
          <description>Counter Control Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Counter enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HDBG</name>
              <description>Halt on Debug</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Do not halt on debug, HLTDBG signal into the counter has no effect.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Halt on debug, when HLTDBG is driven HIGH, the count value is held static.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CNTSR</name>
          <description>Counter Status Register</description>
          <addressOffset>0x4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DBGH</name>
              <description>Debug halted</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CNTCVL</name>
          <description>Current Counter Value Lower register</description>
          <addressOffset>0x8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CNTCVL_L_32</name>
              <description>Current value of Counter, lower 32 bits</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CNTCVU</name>
          <description>Current Counter Value Upper register</description>
          <addressOffset>0xC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CNTCVU_U_32</name>
              <description>Current value of Counter, upper 32 bits</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CNTFID0</name>
          <description>Base Frequency ID</description>
          <addressOffset>0x20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>FREQ</name>
              <description>Frequency in number of ticks per second (up to 4 GHz)</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PIDR4</name>
          <description>Peripheral ID4 Register</description>
          <addressOffset>0xFD0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000004</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DES_2</name>
              <description>JEDEC continuation code indicating the designer of the component, together with the identity code.</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>SIZE</name>
              <description>This is a 4-bit value that indicates the total contiguous size of the memory window used by this component in powers of 2 from the standard 4KB. If a component only requires the standard 4KB, this must read as 0x0, 4KB only. For 8KB set to 0x1, for 16KB set to 0x2, for 32KB set to 0x3, and so on.</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PIDR0</name>
          <description>Peripheral ID0 Register</description>
          <addressOffset>0xFE0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PART_0</name>
              <description>Bits [7:0] of the component part number. This is selected by the designer of the component.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PIDR1</name>
          <description>Peripheral ID1 Register</description>
          <addressOffset>0xFE4</addressOffset>
          <access>read-only</access>
          <resetValue>0x000000B1</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PART_1</name>
              <description>Bits [11:8] of the component part number. This is selected by the designer of the component.</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>DES_0</name>
              <description>Bits [3:0] of the JEDEC identity code indicating the designer of the component, together with the continuation code.</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PIDR2</name>
          <description>Peripheral ID2 Register</description>
          <addressOffset>0xFE8</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000001B</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DES_1</name>
              <description>Bits [6:4] of the JEDEC identity code indicating the designer of the component, together with the continuation code.</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>JEDEC</name>
              <description>Always set. Indicates that a JEDEC assigned value is used.</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>REVISION</name>
              <description>The Revision field is an incremental value starting at 0x0 for the first design of this component. This only increases by 1 for both major and minor revisions and is used as a look-up to establish the exact major and minor revision.</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PIDR3</name>
          <description>Peripheral ID3 Register</description>
          <addressOffset>0xFEC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CMOD</name>
              <description>Where the component is reusable IP, this value indicates if the customer has modified the behavior of the component. In most cases this field is zero.</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>REVAND</name>
              <description>This field indicates minor errata fixes specific to this design, for example metal fixes after implementation. In most cases this field is zero. It is recommended that component designers ensure this field can be changed by a metal fix if required, for example by driving it from registers that reset to zero.</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CIDR0</name>
          <description>Component ID0 Register</description>
          <addressOffset>0xFF0</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000000D</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRMBL_0</name>
              <description>Contains bits[7:0] of the component identification code.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CIDR1</name>
          <description>Component ID1 Register</description>
          <addressOffset>0xFF4</addressOffset>
          <access>read-only</access>
          <resetValue>0x000000F0</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRMBL_1</name>
              <description>Contains bits[11:8] of the component identification code.</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>CLASS</name>
              <description>Class of the component, for example, ROM table or CoreSight component.</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CIDR2</name>
          <description>Component ID2 Register</description>
          <addressOffset>0xFF8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000005</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRMBL_2</name>
              <description>Contains bits[23:16] of the component identification code.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CIDR3</name>
          <description>Component ID3 Register</description>
          <addressOffset>0xFFC</addressOffset>
          <access>read-only</access>
          <resetValue>0x000000B1</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRMBL_3</name>
              <description>Contains bits[31:24] of the component identification code.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
