ankuns/nrfx/bsp/stable/mdk/nrf7140_ml.svd
        <register>
          <name>PIDR3</name>
          <description>Peripheral ID3 Register</description>
          <addressOffset>0xFEC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CMOD</name>
              <description>Customer Modified. Indicates whether the customer has modified the behavior of the component. In most cases,
                    this field is 0b0000. Customers change this value when they make authorized modifications to this component.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Unmodified</name>
                  <description>Indicates that the customer has not modified this component.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REVAND</name>
              <description>Indicates minor errata fixes specific to the revision of the component being used, for example metal fixes after
                    implementation. In most cases, this field is 0b0000. Arm recommends that the component designers ensure that a
                    metal fix can change this field if required, for example, by driving it from registers that reset to 0b0000.</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoErrata</name>
                  <description>Indicates that there are no errata fixes to this component.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CIDR0</name>
          <description>Component ID0 Register</description>
          <addressOffset>0xFF0</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000000D</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRMBL_0</name>
              <description>Preamble[0]. Contains bits[7:0] of the component identification code.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Value</name>
                  <description>Bits[7:0] of the identification code.</description>
                  <value>0x0D</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CIDR1</name>
          <description>Component ID1 Register</description>
          <addressOffset>0xFF4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000090</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRMBL_1</name>
              <description>Preamble[1]. Contains bits[11:8] of the component identification code.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Value</name>
                  <description>Bits[11:8] of the identification code.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLASS</name>
              <description>Class of the component, for example, whether the component is a ROM table or a generic CoreSight component.
                    Contains bits[15:12] of the component identification code</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Coresight</name>
                  <description>Indicates that the component is a CoreSight component.</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CIDR2</name>
          <description>Component ID2 Register</description>
          <addressOffset>0xFF8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000005</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRMBL_2</name>
              <description>Preamble[2]. Contains bits[23:16] of the component identification code.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Value</name>
                  <description>Bits[23:16] of the identification code.</description>
                  <value>0x05</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CIDR3</name>
          <description>Component ID3 Register</description>
          <addressOffset>0xFFC</addressOffset>
          <access>read-only</access>
          <resetValue>0x000000B1</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRMBL_3</name>
              <description>Preamble[3]. Contains bits[31:24] of the component identification code.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Value</name>
                  <description>Bits[31:24] of the identification code.</description>
                  <value>0xB1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
