ankuns/nrfx/bsp/stable/mdk/nrf7140_ml.svd
          <register>
            <name>BUSERROR</name>
            <description>Sink bus error status.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BUSERROR</name>
                <description>Bus error type</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoError</name>
                    <description>There are no errors.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ReadError</name>
                    <description>Error related to memory when reading joblist.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ReadDecodeError</name>
                    <description>Error related to the joblist address when reading joblist.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>WriteError</name>
                    <description>Error related to memory/register when writing data.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>WriteDecodeError</name>
                    <description>Error related to the memory/register address when writing data.</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ADDRESS</name>
            <description>Latest address being accessed on the Sink channel. If a bus error occurs, these registers will contain the address that cause the error.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADDRESS</name>
                <description>Sink address</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>JOBCOUNT</name>
            <description>Number of completed jobs in the current Sink descriptor list. This resets to 0 when a new joblist is started.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>COUNT</name>
                <description>Sink job count</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
    <peripheral>
      <name>AXONS</name>
      <description>Axon wrapper</description>
      <baseAddress>0x4A004000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>AXONS</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>ENABLE</name>
          <description>Enable AXONS.</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>AXONS disabled (powered off).</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>AXONS enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLEEP</name>
              <description>Enable sleep input of AXONS</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>AXONS sleep input not asserted.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>AXONS sleep input asserted.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>AXONPRO</name>
          <description>Unspecified</description>
          <headerStructName>AXONS_AXONPRO</headerStructName>
          <access>read-write</access>
          <addressOffset>0x800</addressOffset>
          <register>
            <name>STSIP</name>
            <description>ATLAZO Design ID</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0x00002000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STSIPID</name>
                <description>This is the ATLAZO IP number. It is 0x2000 to indicate Axon Pro. This can be used by FW driver to validate AXON pro location.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STSAXONPRO</name>
            <description>Axon Pro Version ID</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000109</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STSAXONPROBRANCH</name>
                <description>Axon Pro Branch number</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>STSAXONPROREVISION</name>
                <description>Axon Pro Revision number</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>STSAXONPROVERSION</name>
                <description>Axon Pro Version number. This can be used by FW driver to enable support multiple hardware versions.</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGRESET</name>
            <description>Soft Reset Register</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGRESETSOFT</name>
                <description>Active high soft reset. To perform reset, SW should write this bit to 1 then write it to 0. Doesn't reset programmable registers. Reset is performed asynchronously. Deassertion of reset is synchronized and only takes a few cycles to propagate through internal synchrnonizers</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NORMALOPERATION</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HOLDINRESET</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGCLK</name>
            <description>Clock Gating Register</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGCLKDISABLE</name>
                <description>Active high clock gating. Does not gate off clock to configuration registers to avoid lockup. This can be asserted when block is not in use to save power. This can also be used to measure leakage power in silicon with clocks disabled</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLOCKENABLED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLOCKDISABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CFGCLKIFMAPEN</name>
                <description>Active high clock enable for input feature map read DMA channel. Set to 0 to save power</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLOCKGATEDWHENUNUSED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLOCKALWAYSENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CFGCLKFLTREN</name>
                <description>Active high clock enable for filter read DMA channel. Set to 0 to save power</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLOCKGATEDWHENUNUSED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLOCKALWAYSENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CFGCLKPSUMEN</name>
                <description>Active high clock enable for partial sum read DMA channel. Set to 0 to save power</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLOCKGATEDWHENUNUSED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLOCKALWAYSENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CFGCLKCUEN</name>
                <description>Active high clock enable for compute unit. Set to 0 to save power</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLOCKGATEDWHENUNUSED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLOCKALWAYSENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGRAM</name>
            <description>22nm Ram Control Register</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x01000053</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGRAMEMAA</name>
                <description>RAM port A  pins slow down memory access and provide extra time for memory read and write operations. The access time, cycle time, and margin increase as the pins are driven from 000-111, respectively. That is, 000 is the fastest setting and 111 the slowest</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>CFGRAMEMAB</name>
                <description>RAM port B  pins slow down memory access and provide extra time for memory read and write operations. The access time, cycle time, and margin increase as the pins are driven from 000-111, respectively. That is, 000 is the fastest setting and 111 the slowest</description>
                <lsb>4</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>CFGRAMEMASA</name>
                <description>RAM EMASA enables the bitline keeper. Set EMASA to 1 to enable the bitline keeper. The memory provides a bitline keeper for Port A read operations. The keeper affects the cycle time in the read cycle. It does not affect the access time. Enabling the bitline keeper can help to counteract the effects of leakage in a high-leakage process environment.</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>CFGRAMSTOV</name>
                <description>The RAM STOV feature allows you to override the self-timed generation of the clock pulse internal to the memory. When the STOV is asserted, the internal clock pulse is generated directly from the high phase of the external clock input.</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>CFGRAMWABLM</name>
                <description>RAM write assist setting. 0 for 0.8V. 1 for 0.7,0.6V</description>
                <lsb>16</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>CFGRAMWABL</name>
                <description>When logic 1, enable write assist for RAMs</description>
                <lsb>24</lsb>
                <msb>24</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGDUMMY</name>
            <description>Dummy Register</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x00C0FFEE</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGDUMMYVALUE</name>
                <description>Doesn't have any associated behavior in block. Can be used by FW to test AHB slave port read and write operation</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
