ankuns/nrfx/bsp/stable/mdk/nrf7140_ml.svd
          <register>
            <name>INTTRIGGER</name>
            <description>Interrupt Trigger Event. This register is not sticky and shows the trigger for the interrupt in corresponding int_clr register bit</description>
            <addressOffset>0x028</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INTTRIGGERRESULTREADYINTV</name>
                <description>Result ready trigger</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>INTTRIGGERFINISHEDINTV</name>
                <description>Axon Pro Finished trigger</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>INTTRIGGERCBVALIDINTV</name>
                <description>Axon Pro done valid commad buffer trigger</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>INTTRIGGERSATURATIONINTV</name>
                <description>Saturation trigger</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>INTTRIGGERWDOGTIMEOUTHREADYINTV</name>
                <description>AHB master hready Watchdog timeout trigger</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>INTTRIGGERWDOGTIMEOUTHGRANTINTV</name>
                <description>AHB master hgrant Watchdog timeout trigger</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>INTTRIGGERWDOGTIMEOUTCMDINTV</name>
                <description>Command Watchdog timeout trigger</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>INTTRIGGERWDOGTIMEOUTFINISHINTV</name>
                <description>Finished Watchdog timeout trigger</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>INTTRIGGERAHBSLAVESPLITINTV</name>
                <description>AHB slave split trigger</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>INTTRIGGERAHBSLAVERETRYINTV</name>
                <description>AHB slave retry trigger</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>INTTRIGGERAHBEARLYTERMINTV</name>
                <description>AHB early termination trigger</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>INTTRIGGERAHBERRBURSTINTV</name>
                <description>AHB error burst trigger</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>INTTRIGGERAHBERRSLAVESPLITBADINTV</name>
                <description>AHB error slave split bad trigger</description>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>INTTRIGGERAHBERRSLAVERETRYBADINTV</name>
                <description>AHB error slave retry bad trigger</description>
                <lsb>14</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>INTTRIGGERAHBERRSLAVEERRORBADINTV</name>
                <description>AHB error slave error bad trigger</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>INTTRIGGERAHBSLAVEERRORINTV</name>
                <description>AHB Slave Error trigger</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>INTTRIGGERAHBERRHRESPNOTOKINTV</name>
                <description>AHB Error HRESP not OK trigger</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>INTTRIGGERRFIFOUDRINTV</name>
                <description>Read data Fifo Underrun error trigger</description>
                <lsb>24</lsb>
                <msb>24</msb>
              </field>
              <field>
                <name>INTTRIGGERWFIFOUDRINTV</name>
                <description>Write data Fifo Underrun error trigger</description>
                <lsb>25</lsb>
                <msb>25</msb>
              </field>
              <field>
                <name>INTTRIGGERCFIFOUDRINTV</name>
                <description>Control Fifo Underrun error trigger</description>
                <lsb>26</lsb>
                <msb>26</msb>
              </field>
              <field>
                <name>INTTRIGGERCBFIFOUDRINTV</name>
                <description>Command Buffer Fifo Underrun error trigger</description>
                <lsb>27</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>INTTRIGGERRFIFOOVRINTV</name>
                <description>Read data Fifo Overrun error trigger</description>
                <lsb>28</lsb>
                <msb>28</msb>
              </field>
              <field>
                <name>INTTRIGGERWFIFOOVRINTV</name>
                <description>Write data Fifo Overrun error trigger</description>
                <lsb>29</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>INTTRIGGERCFIFOOVRINTV</name>
                <description>Control Fifo Overrun error trigger</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>INTTRIGGERCBFIFOOVRINTV</name>
                <description>Command buffer Fifo Overrun error trigger</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGCORE</name>
            <description>Configuration Register</description>
            <addressOffset>0x040</addressOffset>
            <access>read-write</access>
            <resetValue>0x1002000F</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGCOREWDOGENHREADY</name>
                <description>Set 1 to enable watchdog timer for receiving hready on AHB master port. Set 0 to disable watchdog timer</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>CFGCOREWDOGENHGRANT</name>
                <description>Set 1 to enable watchdog timer for receiving hgrant on AHB master port. Set 0 to disable watchdog timer</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>CFGCOREWDOGENCMD</name>
                <description>Set 1 to enable watchdog timer for processing each command. Set 0 to disable watchdog timer</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>CFGCOREWDOGENFINISH</name>
                <description>Set 1 to enable watchdog timer for processing all command buffer. Set 0 to disable watchdog timer</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>CFGCORESTEPEN</name>
                <description>Set 1 to enable FW to step throught each command processed by triggering req_core_step. Set 0 so no FW involvement is needed per command</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>CFGCOREMAXAHBBURST</name>
                <description>Specifies the maximum allowed burst size on the master AHB port</description>
                <lsb>16</lsb>
                <msb>17</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SINGLE</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FOURBEATS</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EIGHTBEATS</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SIXTEENBEATS</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CFGCORESTOPONERR</name>
                <description>When 1, Axon Pro will stop when an error is detected for FW to perform a sw reset using cfg_reset_soft. When 0, Axon Pro statemachine will keep going when an error is detected</description>
                <lsb>28</lsb>
                <msb>28</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGSLEEP</name>
            <description>Sleep Configuration Register</description>
            <addressOffset>0x044</addressOffset>
            <access>read-write</access>
            <resetValue>0x18006000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGSLEEPINACTIVITYTIMER</name>
                <description>The number of clock cycles of inactivity to wait before going to sleep</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>CFGSLEEPWAKEUPTIMER</name>
                <description>Axon Pro will wait for the number of progammed cycles after wakeup to allow clock to settle</description>
                <lsb>24</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>CFGSLEEPEN</name>
                <description>When logic 1, The Axon Pro will sleep if there is no commands to process for the duraction of the time specified by cfg_sleep_inactivity_timer. The Axon Pro will automatically wakeup if any registers are written. Register reads will leave the Axon Pro in sleep. When logic 0, Axon Pro will not go into sleep mode</description>
                <lsb>28</lsb>
                <msb>28</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGWDOGTIMER</name>
            <description>Watchdog Configuration Register</description>
            <addressOffset>0x048</addressOffset>
            <access>read-write</access>
            <resetValue>0x0101C810</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGWDOGTIMERHREADY</name>
                <description>Axon Pro will wait the programmed number of clock cyles to receive hready on AHB master port, otherwise the watchdog timer will expire and trigger an interrupt</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>CFGWDOGTIMERHGRANT</name>
                <description>Axon Pro will wait the programmed number of clock cyles to receive hgrant on AHB master port when requesting the bus, otherwise the watchdog timer will expire and trigger an interrupt</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>CFGWDOGTIMERCMD</name>
                <description>Axon Pro will wait the programmed number of clock cyles * 2^16 for a command to finish processing, otherwise the watchdog timer will expire and trigger an interrupt</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>CFGWDOGTIMERFINISH</name>
                <description>Axon Pro will wait the programmed number of clock cyles * 2^28 for all the command buffer to finish processing, otherwise the watchdog timer will expire and trigger an interrupt</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGSPARE</name>
            <description>Spare Register</description>
            <addressOffset>0x04C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGSPAREBIT</name>
                <description>Spare bits, reserved for ECO. Should be set to all zero</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGPMON</name>
            <description>Performance Monitor Configuration Register</description>
            <addressOffset>0x050</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGPMONMODE</name>
                <description>Performance Monitor Mode of Operation. When disabled, sts_pmon_m/lsb_cnt is 0. When free running, sts_pmon_m/lsb_cnt is incrmenting 64 bit counter. The counter will rollover and no triggering is necessary. When counting events, the internal 64 bit counter will count the number of times the event specified by cfg_pmon_sel_event occurs. The counter will saturate when it reaches the maximum value. Once triggered by req_core_pmon_trig, sts_pmon_msb_cnt and sts_pmon_lsb_cnt will be updated with the internal counter value and the internal counter will be reset. When measuring latency, the internal 64 bit counter will start the latency measurment when triggered by req_core_pmon_trig. Once the measurement is complete, the value will be updated to sts_pmon_msb_cnt and sts_pmon_lsb_cnt and then req_core_pmon_trig will auto clear. The specific latency to measure is specifed by cfg_pmon_sel_event setting. The latency can be averaged over a number of measurments as specifed by cfg_pmon_average setting. The counter will saturate when maximum is reached</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FREERUNNING</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EVENTCOUNT</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EVENTLATENCY</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CFGPMONSELEVENT</name>
                <description>In Free_Running mode, the first bit cfg_pmon_sel_event[0] = 1 means count the clock cycles only when AXON is active, 0 means keep counting. Otherwise cfg_pmon_sel_event selects which event to count or measure latency</description>
                <lsb>8</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NUMINTERRUPTCYCLES</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NUMIDLECYCLES</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NUMBUSYCYCLES</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NUMFINISHEDINTERRUPTS</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NUMCOMMANDS</name>
                    <description>Unspecified</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NUMCONTROLBUFFERFETCHCYCLES</name>
                    <description>Unspecified</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NUMCOMMANDEXECUTECYCLES</name>
                    <description>Unspecified</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NUMFLUSHOUTPUTCYCLES</name>
                    <description>Unspecified</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CFGPMONAVERAGE</name>
                <description>Amount of averaging in latency measurement mode. Value is 2 ^ cfg_pmon_average. 0 means no averaging. 1 means average two measurements. 2 means average 4 measurements. 3 means average 8 measurments, and so on</description>
                <lsb>16</lsb>
                <msb>19</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGPMONAHB</name>
            <description>Performance Monitor AHB Configuration Register</description>
            <addressOffset>0x054</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGPMONAHBMODE</name>
                <description>Performance Monitor Mode of Operation. After writing this bit, req_core_pmon_ahb_rw must be set 1 to take effect. When disabled, sts_pmon_ahb_m/lsb_cnt is 0. When free running, sts_pmon_ahb_m/lsb_cnt is incrmenting 64 bit counter. The counter will rollover and no triggering is necessary. When counting events, the internal 64 bit counter will count the number of times the event specified by cfg_pmon_ahb_sel_event occurs. The counter will saturate when it reaches the maximum value. Once triggered by req_core_pmon_ahb_trig, sts_pmon_ahb_msb_cnt and sts_pmon_ahb_lsb_cnt will be updated with the internal counter value and the internal counter will be reset. When measuring latency, the internal 64 bit counter will start the latency measurment when triggered by req_core_pmon_ahb_trig. Once the measurement is complete, the value will be updated to sts_pmon_ahb_msb_cnt and sts_pmon_ahb_lsb_cnt and then req_core_pmon_ahb_trig will auto clear. The specific latency to measure is specifed by cfg_pmon_ahb_sel_event setting. The latency can be averaged over a number of measurments as specifed by cfg_pmon_ahb_average setting. The counter will saturate when maximum is reached</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>CFGPMONAHBSELEVENT</name>
                <description>Select which event to count or measure latency. After writing this bit, req_core_pmon_ahb_rw must be set 1 to take effect.</description>
                <lsb>8</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NUMWRITECYCLES</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NUMREADCYCLES</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NUMWRITEWAITCYCLES</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NUMREADWAITCYCLES</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NUMFIRSTREADWAITCYCLES</name>
                    <description>Unspecified</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NUMRESTREADWAITCYCLES</name>
                    <description>Unspecified</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NUMBUSCYCLES</name>
                    <description>Unspecified</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NUMBUSWAITCYCLES</name>
                    <description>Unspecified</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CFGPMONAHBAVERAGE</name>
                <description>Amount of averaging in latency measurement mode. Value is 2 ^ cfg_pmon_ahb_average. 0 means no averaging. 1 means average two measurements. 2 means average 4 measurements. 3 means average 8 measurments, and so on. After writing this bit, req_core_pmon_ahb_rw must be set 1 to take effect.</description>
                <lsb>16</lsb>
                <msb>19</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGPSUMCONFIG2</name>
            <description>Partial Sum Configuration Register</description>
            <addressOffset>0x07C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGPSUMCONFIG2ZSTRIDE</name>
                <description>Offset value in byte between two partial sums.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
