ankuns/nrfx/bsp/stable/mdk/nrf7140_ml.svd
          <register>
            <name>CFGINFMAPSIZE</name>
            <description>Input Feature Map Size Register</description>
            <addressOffset>0x080</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGINFMAPSIZEX</name>
                <description>Input feature map number of columns. Units in pixels</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>CFGINFMAPSIZEY</name>
                <description>Input feature map number of rows. Units in pixels (8 bit or 4 bits)</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGINFMAPPTR</name>
            <description>Input Feature Map Pointer</description>
            <addressOffset>0x084</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGINFMAPPTRADDR</name>
                <description>Byte address of input feature map.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGINFMAPCONFIG</name>
            <description>Input Feature Map Configuration Register</description>
            <addressOffset>0x088</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGINFMAPCONFIGSTRIDE</name>
                <description>Offset value to required stripe of input feature map. Units in bytes. Minimum allowed value is equal to number of bytes in the columns width.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>CFGINFMAPCONFIGBITWIDTH</name>
                <description>Bit width of input feature map pixels. For feature map only 4 and 8 bits are supported.</description>
                <lsb>16</lsb>
                <msb>18</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>BITS04</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BITS08</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BITS16</name>
                    <description>Unspecified</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BITS32</name>
                    <description>Unspecified</description>
                    <value>0x5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CFGINFMAPCONFIGDISABLELOAD</name>
                <description>When logic 1, AXON pro will not load input feature map from memory, instead it will reuse the previous data stored in the line buffer.</description>
                <lsb>19</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>CFGINFMAPCONFIGLINES</name>
                <description>Indicates the number of lines to prefetch and use in internal line buffer storage.</description>
                <lsb>20</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>CFGINFMAPCONFIGOFFSET</name>
                <description>When logic 1, starts at upper nibble of indicated byte address in 4 bit mode. When logic 0, starts at lower nibble of indicated byte address. Must be set to 0 if bit width is larger than 4 bits.</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>CFGINFMAPCONFIGSTRIDEOFFSET</name>
                <description>When logic 1, addes a nibble offset to stride</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGINFMAPCONFIG2</name>
            <description>Input Feature Map Configuration Register 2</description>
            <addressOffset>0x08C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGINFMAPCONFIG2ZSTRIDE</name>
                <description>Offset value in byte between two feature map surfaces.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>CFGINFMAPCONFIG2CACHEPREFETCHEN</name>
                <description>enable fmap cache prefetch mode</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>CFGINFMAPCONFIG2CACHEPERFEN</name>
                <description>enable fmap cache performance mode</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>CFGINFMAPCONFIG2FMAPFIT</name>
                <description>1: indiacates that all fmap data fits in multi fiter modes, used for PWC and CONV only</description>
                <lsb>18</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>CFGINFMAPCONFIG2ZSTRIDEOFFSET</name>
                <description>Additional nibble offset to be added to z_stride. Used in pointwise convolution command. Should be set to0 if bit width is not 4 bit setting.</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGFILTERSIZE</name>
            <description>Filter Size Register</description>
            <addressOffset>0x090</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGFILTERSIZEX</name>
                <description>Filter number of columns. Units in pixels</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>CFGFILTERSIZEY</name>
                <description>Filter number of rows. Units in pixels</description>
                <lsb>16</lsb>
                <msb>25</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGFILTERPTR</name>
            <description>Filter Pointer</description>
            <addressOffset>0x094</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGFILTERPTRADDR</name>
                <description>Byte address of filter. Must be 32 bit aligned</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGFILTERCONFIG</name>
            <description>Filter Configuration Register</description>
            <addressOffset>0x098</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGFILTERCONFIGCOUNT</name>
                <description>Number of filters to apply to given input feature map</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>CFGFILTERCONFIGSCRATCHEN</name>
                <description>When logic 1, filter data is stored in scratch flops to save power. This mode is limited to filters sizes upto 5x5. When logic 0, filter data is stored in internal line buffer RAM</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>CFGFILTERCONFIGBITWIDTH</name>
                <description>Bit width of filter pixels. For filters, only 4 bits and 8 bits supported.</description>
                <lsb>16</lsb>
                <msb>18</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>BITS04</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BITS08</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BITS16</name>
                    <description>Unspecified</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BITS32</name>
                    <description>Unspecified</description>
                    <value>0x5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CFGFILTERCONFIGDISABLELOAD</name>
                <description>When logic 1, AXON pro will not load input feature map from memory, instead it will reuse the previous data stored in the line buffer.</description>
                <lsb>19</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>CFGFILTERCONFIGLINES</name>
                <description>Indicates the number of lines to prefetch and use in internal line buffer storage.</description>
                <lsb>20</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>CFGFILTERCONFIGOFFSET</name>
                <description>When logic 1, starts at upper nibble of indicated byte address in 4 bit mode. When logic 0, starts at lower nibble of indicated byte address. Must be set to 0 if bit width is larger than 4 bits.</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGFILTERCONFIG2</name>
            <description>Filter Configuration Register 2</description>
            <addressOffset>0x09C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGFILTERCONFIG2ZSTRIDE</name>
                <description>Offset value in byte between two filters surfaces. used on conv and pwc.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>CFGFILTERCONFIG2CACHEPREFETCHEN</name>
                <description>enable filter cache prefetch mode</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>CFGFILTERCONFIG2CACHEPERFEN</name>
                <description>enable filter cache performance mode</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>CFGFILTERCONFIG2SINGLELINE</name>
                <description>When logic 1, all the filters are fetched using a single transaction for maximizing bus utilization. When logic 0, each filter row is fetched independantly.</description>
                <lsb>19</lsb>
                <msb>19</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGPSUMSIZE</name>
            <description>Partial Sum Size Register</description>
            <addressOffset>0x0A0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGPSUMSIZEX</name>
                <description>Partial sum number of columns. Units in rows</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>CFGPSUMSIZEY</name>
                <description>Partial sum number of rows. Units in pixels</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGPSUMPTR</name>
            <description>Partial Sum Pointer</description>
            <addressOffset>0x0A4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGPSUMPTRADDR</name>
                <description>Byte address of partial sum. Must be 32 bit aligned</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGPSUMCONFIG</name>
            <description>Partial Sum Configuration Register</description>
            <addressOffset>0x0A8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGPSUMCONFIGSTRIDE</name>
                <description>Offset value to required stripe of partial sum. Units in bytes. Must be 32 bit aligned</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>CFGPSUMCONFIGBITWIDTH</name>
                <description>Bit width of partial sum pixels</description>
                <lsb>16</lsb>
                <msb>18</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>BITS04</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BITS08</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BITS16</name>
                    <description>Unspecified</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BITS32</name>
                    <description>Unspecified</description>
                    <value>0x5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CFGPSUMCONFIGSINGLELINE</name>
                <description>When logic 1, output partial sum as a single line.</description>
                <lsb>19</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>CFGPSUMCONFIGDISABLELOAD</name>
                <description>When logic 1, AXON pro will not load partial sum from memory, instead it will reuse the previous data stored in the partial sum buffer. When logic 0, AXON pro will load partial sum from memory.</description>
                <lsb>20</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>CFGPSUMCONFIGOFFSET</name>
                <description>When logic 1, starts at upper nibble of indicated byte address in 4 bit mode. When logic 0, starts at lower nibble of indicated byte address. Must be set to 0 if bit width is larger than 4 bits.</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>CFGPSUMCONFIGSTRIDEOFFSET</name>
                <description>When logic 1, addes a nibble offset to stride</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGOUTFMAPSIZE</name>
            <description>Output Feature Map Size Register</description>
            <addressOffset>0x0AC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGOUTFMAPSIZEX</name>
                <description>Output feature map number of columns. Units in pixels</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>CFGOUTFMAPSIZEY</name>
                <description>Output feature map number of rows. Units in pixels</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGOUTFMAPPTR</name>
            <description>Output Feature Map Pointer</description>
            <addressOffset>0x0B0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGOUTFMAPPTRADDR</name>
                <description>Byte address of output feature map. Must be 32 bit aligned</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGOUTFMAPCONFIG</name>
            <description>Output Feature Map Configuration Register</description>
            <addressOffset>0x0B4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGOUTFMAPCONFIGSTRIDE</name>
                <description>Offset value to required stripe of output feature map. Units in bytes. Must be 32 bit aligned</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>CFGOUTFMAPCONFIGBITWIDTH</name>
                <description>Bit width of output feature map pixels. Only 8, 16 and 32 bits supported.</description>
                <lsb>16</lsb>
                <msb>18</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>BITS04</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BITS08</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BITS16</name>
                    <description>Unspecified</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BITS32</name>
                    <description>Unspecified</description>
                    <value>0x5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CFGOUTFMAPCONFIGSINGLELINE</name>
                <description>When logic 1, output feature map as a single line</description>
                <lsb>19</lsb>
                <msb>19</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGOUTFMAPCONFIG2</name>
            <description>Output Feature Map Config2</description>
            <addressOffset>0x0B8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGOUTFMAPCONFIG2ZSTRIDE</name>
                <description>Offset value in byte between two output feature map surfaces.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGPADDING</name>
            <description>Padding Control Register</description>
            <addressOffset>0x0BC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGPADDINGRIGHT</name>
                <description>Number of pixel columns to pad at right of input activation map. Units are in pixels</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>CFGPADDINGLEFT</name>
                <description>Number of pixel columns to pad at left of input activation map. Units are in pixels</description>
                <lsb>8</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>CFGPADDINGBOTTOM</name>
                <description>Number of pixel rows to pad at bottom of input activation map. Units are in pixels</description>
                <lsb>16</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>CFGPADDINGTOP</name>
                <description>Number of pixel rows to pad at top of input activation map. Units are in pixels</description>
                <lsb>24</lsb>
                <msb>27</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGPADDINGCONFIG</name>
            <description>Padding Config</description>
            <addressOffset>0x0C0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGPADDINGVALUE</name>
                <description>16 bit signed value for padding.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGBIAS</name>
            <description>Bias Register</description>
            <addressOffset>0x0C4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGBIASVALUE</name>
                <description>Bias value to add to output</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
