ankuns/nrfx/bsp/stable/mdk/nrf7140_ml.svd
          <register>
            <name>CFGBIASCONFIG</name>
            <description>Bias Configuration Register</description>
            <addressOffset>0x0C8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGBIASCONFIGSHIFT</name>
                <description>Bias shift amount</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>CFGBIASCONFIGDIR</name>
                <description>Shift direction for bias value</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SHIFTRIGHT</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SHIFTLEFT</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CFGBIASCONFIGMODE</name>
                <description>Where in computation pipeline to add the bias</description>
                <lsb>16</lsb>
                <msb>17</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGCU</name>
            <description>Compute Unit Configuration Register</description>
            <addressOffset>0x0CC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGCUSHIFT</name>
                <description>Shift amount for compute unit output</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>CFGCUDIR</name>
                <description>Shift direction for compute unit output</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SHIFTRIGHT</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SHIFTLEFT</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CFGCUSKIDX</name>
                <description>Number of pixel columns to move filter during convolution. Units in pixels</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>CFGCUSKIDY</name>
                <description>Number of pixel rows to move filter during convolution. Units in pixels</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGNL</name>
            <description>Non Linear Configuration Register</description>
            <addressOffset>0x0D0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGNLSHIFT</name>
                <description>Shift amount after non linear processing</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>CFGNLDIR</name>
                <description>Shift direction after non linear processing</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SHIFTRIGHT</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SHIFTLEFT</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CFGNLEN</name>
                <description>Enable non linear</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>CFGNLMODE</name>
                <description>Non linear mode</description>
                <lsb>24</lsb>
                <msb>26</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>RELUHW</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LOOKUPTABLE16BITLSB</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LOOKUPTABLE16BITMSB</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LOOKUPTABLE32BIT</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RELULOOKUPTABLE16BITLSB</name>
                    <description>Unspecified</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RELULOOKUPTABLE16BITMSB</name>
                    <description>Unspecified</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RELULOOKUPTABLE32BIT</name>
                    <description>Unspecified</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGROUND</name>
            <description>Rounding and Saturation Configuration Register</description>
            <addressOffset>0x0D4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGROUNDSATSIZE</name>
                <description>Saturation size</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>BITS04</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BITS08</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BITS16</name>
                    <description>Unspecified</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BITS32</name>
                    <description>Unspecified</description>
                    <value>0x5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CFGROUNDSIZE</name>
                <description>Rounding size</description>
                <lsb>8</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>CFGROUNDEN</name>
                <description>Enable rounding</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGCOMMAND</name>
            <description>Command Configurtion Register</description>
            <addressOffset>0x0D8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGCOMMANDCODE</name>
                <description>Command to execute</description>
                <lsb>0</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DMA</name>
                    <description>Unspecified</description>
                    <value>0x00</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CONV</name>
                    <description>Unspecified</description>
                    <value>0x01</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PWCONV</name>
                    <description>Unspecified</description>
                    <value>0x02</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MAXPOOL</name>
                    <description>Unspecified</description>
                    <value>0x03</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AVGPOOL</name>
                    <description>Unspecified</description>
                    <value>0x04</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MATMUL</name>
                    <description>Unspecified</description>
                    <value>0x05</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AXPBY</name>
                    <description>Unspecified</description>
                    <value>0x06</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AXPB</name>
                    <description>Unspecified</description>
                    <value>0x07</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>XTY</name>
                    <description>Unspecified</description>
                    <value>0x08</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>XPY</name>
                    <description>Unspecified</description>
                    <value>0x09</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CFGCOMMANDPSMODE</name>
                <description>Partial Sum input, output mode</description>
                <lsb>8</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PARTIALNONE</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PARTIALOUT</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PARTIALIN</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PARTIALINOUT</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CFGCOMMANDLOCPSUMEN</name>
                <description>When logic 1, enable PSUM local TCM access. Setting this bit to 0 will disable access for PSUM. TCM will be used to store/read PSUM data</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>CFGCOMMANDWPOST</name>
                <description>When logic 1, writes are posted. When logic 0, writes are flushed. This should be set only if current command doesnot need output of previous command as it may still be infligt</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>CFGCOMMANDPOSTREGCFGCOUNT</name>
                <description>number of registers that can be configured after each command. this register is only applicable to PWC and CONV with number of filters are larger than 1</description>
                <lsb>24</lsb>
                <msb>28</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGCONSTANT</name>
            <description>Constant Configuration Register</description>
            <addressOffset>0x0DC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGCONSTANTA</name>
                <description>B constant value. two's complement format</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>CFGCONSTANTB</name>
                <description>A constant value. two's complement format</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGCMDBUFFERPTR</name>
            <description>Command Buffer Pointer</description>
            <addressOffset>0x0E0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGCMDBUFFERPTRADDR</name>
                <description>Byte address of command buffer. Must be aligned to 32 bit</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGCMDBUFFER</name>
            <description>Command Buffer Configuration Register</description>
            <addressOffset>0x0E4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGCMDBUFFERLENGTH</name>
                <description>Total number of DWORDS in command buffer.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>CFGCMDBUFFERVALID</name>
                <description>Number of valid DWORDS (32 bits) in command buffer. FW updates this field to synchronize with HW and let HW progress upto this location. Each Entry is atleast 64 bitss. Entry[15:0] = address. Entry[19:16] = active low write byte enable, 0 = write all 4 bytes, E=write only first byte. Entry[31:24] = number of data DWORDS. Entry[63:32] = data0, .... Little endian format, ie Entry[31:0] is lower address than Entry[63:32]</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>REQCORE</name>
            <description>Core Request Register</description>
            <addressOffset>0x0F0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>REQCORESTART</name>
                <description>Start processing the command buffer</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>REQCORENEWCMD</name>
                <description>Execute new command</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>REQCORESTEP</name>
                <description>Proceed to executing the next command</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>REQCOREREADSTATUS</name>
                <description>Sample all status bits that are in the ahb clock domiain</description>
                <lsb>24</lsb>
                <msb>24</msb>
              </field>
              <field>
                <name>REQCOREPMONTRIG</name>
                <description>Update sts_pmon_msb_cnt and sts_pmon_lsb_cnt. Not required in free running mode.</description>
                <lsb>28</lsb>
                <msb>28</msb>
              </field>
              <field>
                <name>REQCOREPMONAHBTRIG</name>
                <description>Update sts_pmon_ahb_msb_cnt and sts_pmon_ahb_lsb_cnt. Not required in free running mode.</description>
                <lsb>29</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>REQCOREPMONAHBRW</name>
                <description>Update cfg_pmon_ahb_mode, cfg_pmon_ahb_sel_event, cfg_pmon_ahb_average settings to core.</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STSCMDBUFFERPTR</name>
            <description>Command Buffer Pointer Status</description>
            <addressOffset>0x100</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STSCMDBUFFERPTRADDR</name>
                <description>Read back of the next byte address of commnd buffer pointer to execute. Similar to program counter in traditional processor.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STSASLEEP</name>
            <description>Sleep Status Register</description>
            <addressOffset>0x104</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STSASLEEPMODE</name>
                <description>When logic 1, indicates Axon Pro is in sleep state. Any register write will wakeup Axon Pro</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NORMALMODE</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SLEEPMODE</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>STSMSBACC</name>
            <description>Accumulator Most Significant Status Register</description>
            <addressOffset>0x108</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STSMSBACCRESULT</name>
                <description>Accumulator[63:32]</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STSLSBACC</name>
            <description>Accumulator Least Significant Status Register</description>
            <addressOffset>0x10C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STSLSBACCRESULT</name>
                <description>Accumulator[31:0]</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STSMAHB</name>
            <description>AHB Master Last Access Address Status Register</description>
            <addressOffset>0x110</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STSMAHBADDR</name>
                <description>The address of the last access preformed by AHB master. Must trigger req_core_read_status to update this field</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
