ankuns/nrfx/bsp/stable/mdk/nrf7140_ml.svd
          <register>
            <name>STSFSM</name>
            <description>Finite State Machines Status Register</description>
            <addressOffset>0x114</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STSFSMCB</name>
                <description>State of command buffer state machine</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>STATEIDLE</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATESTART</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEREADREQ</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEREADDATA</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEWAIT</name>
                    <description>Unspecified</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEERR</name>
                    <description>Unspecified</description>
                    <value>0x5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>STSFSMCBLBI</name>
                <description>State of command buffer LBI state machine</description>
                <lsb>3</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>STATEIDLE</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEADDR</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEDATA</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEWAITCMD</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEWAITSTEP</name>
                    <description>Unspecified</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>STSFSMCNTRL</name>
                <description>State of controller state machine</description>
                <lsb>8</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>STSFSMSLEEP</name>
                <description>State of sleep statemachine</description>
                <lsb>14</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>STATEACTIVE</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEINACTIVE</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATESLEEP</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEWAKEUP</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>STSFSMDMAAHB</name>
                <description>State of DMA AHB interface statemachine. Must trigger req_core_read_status to update this field</description>
                <lsb>16</lsb>
                <msb>19</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>STATEIDLE</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEREQ</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEWRITE</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEREAD</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATESWRITE</name>
                    <description>Unspecified</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATESWRITEREQ</name>
                    <description>Unspecified</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATESREAD</name>
                    <description>Unspecified</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATESREADREQ</name>
                    <description>Unspecified</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEERR</name>
                    <description>Unspecified</description>
                    <value>0x8</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>STSFSMDMAARB</name>
                <description>State of DMA Arbitor statemachine</description>
                <lsb>20</lsb>
                <msb>21</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>STATEIDLE</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEWRITE</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEREAD</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEERR</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>STSFSMDMAWCHOFMAP</name>
                <description>State of DMA Output Feature Map Write Channel statemachine</description>
                <lsb>22</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>STATEIDLE</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEWRITEREQ</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEWRITEDATA</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEERR</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>STSFSMDMARCHPRTL</name>
                <description>State of DMA Partials Read Channel statemachine</description>
                <lsb>24</lsb>
                <msb>25</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>STATEIDLE</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEREADREQ</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEREADDATA</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEERR</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>STSFSMDMARCHFLTR</name>
                <description>State of DMA Filter Read Channel statemachine</description>
                <lsb>26</lsb>
                <msb>27</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>STATEIDLE</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEREADREQ</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEREADDATA</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEERR</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>STSFSMDMARCHIFMAP</name>
                <description>State of DMA Input Feature Map Read Channel statemachine</description>
                <lsb>28</lsb>
                <msb>29</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>STATEIDLE</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEREADREQ</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEREADDATA</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEERR</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>STSFSMDMARCHREG</name>
                <description>State of DMA Registers Read Channel statemachine</description>
                <lsb>30</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>STATEIDLE</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEREADREQ</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEREADDATA</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEERR</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>STSFIFO</name>
            <description>FIFO Level Status Register</description>
            <addressOffset>0x118</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STSFIFORDSIZE</name>
                <description>Number of entries used in Read data Fifo</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>STSFIFORDEMPTY</name>
                <description>Read data Fifo Empty indicator</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>STSFIFORDFULL</name>
                <description>Read data Fifo Full indicator. Must trigger req_core_read_status to update this field</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>STSFIFOWRSIZE</name>
                <description>Number of entries used in Write data Fifo</description>
                <lsb>8</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>STSFIFOWREMPTY</name>
                <description>Write data Fifo Empty indicator. Must trigger req_core_read_status to update this field</description>
                <lsb>14</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>STSFIFOWRFULL</name>
                <description>Write data Fifo Full indicator</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>STSFIFOCTLSIZE</name>
                <description>Number of entries used in Control Fifo</description>
                <lsb>16</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>STSFIFOCTLEMPTY</name>
                <description>Control Fifo Empty indicator. Must trigger req_core_read_status to update this field</description>
                <lsb>22</lsb>
                <msb>22</msb>
              </field>
              <field>
                <name>STSFIFOCTLFULL</name>
                <description>Control Fifo Full indicator</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>STSFIFOCBSIZE</name>
                <description>Number of entries used in Command Buffer Fifo</description>
                <lsb>24</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>STSFIFOCBEMPTY</name>
                <description>Command Buffer Fifo Empty indicator</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>STSFIFOCBFULL</name>
                <description>Command Buffer Fifo Full indicator</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STSDMA</name>
            <description>DMA Status Register</description>
            <addressOffset>0x11C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STSDMACNTRFREE</name>
                <description>The value of free entries in the read fifo</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STSPMONMSB</name>
            <description>Performance Counter Most Significant Word</description>
            <addressOffset>0x120</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STSPMONMSBCNT</name>
                <description>Perfromance counter bits 63 to 32. Must trigger req_core_pmon_trig to update, except in free running mode</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STSPMONLSB</name>
            <description>Performance Counter Least Significant Word</description>
            <addressOffset>0x124</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STSPMONLSBCNT</name>
                <description>Performance counter bits 31 to 0. Must trigger req_core_pmon_trig to update, except in free running mode</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STSPMONAHBMSB</name>
            <description>Performance Counter AHB Most Significant Word</description>
            <addressOffset>0x128</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STSPMONAHBMSBCNT</name>
                <description>Perfromance counter bits 63 to 32. Must trigger req_core_pmon_ahb_trig then req_core_read_status to update this field</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STSPMONAHBLSB</name>
            <description>Performance Counter AHB Least Significant Word</description>
            <addressOffset>0x12C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STSPMONAHBLSBCNT</name>
                <description>Performance counter bits 31 to 0. Must trigger req_core_pmon_ahb_trig then req_core_read_status to update this field</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGROUNDM</name>
            <description>Rounding and Saturation Configuration Register</description>
            <addressOffset>0x160</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGROUNDSATSIZEM</name>
                <description>Saturation size</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>BITS04</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BITS08</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BITS16</name>
                    <description>Unspecified</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BITS32</name>
                    <description>Unspecified</description>
                    <value>0x5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CFGROUNDSIZEM</name>
                <description>Rounding size</description>
                <lsb>8</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>CFGROUNDENM</name>
                <description>Enable rounding</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGBIASM</name>
            <description>Bias Register</description>
            <addressOffset>0x164</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGBIASVALUEM</name>
                <description>Bias value to add to output</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGNLLUTM1M</name>
            <description>Slope Register For Lookup Table Entry 1</description>
            <addressOffset>0x168</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGNLLUTM1SLOPEM</name>
                <description>Slope value for lookup table entry 1. Input is multiplied by this slope value and added to offset. two's complement format</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
