ankuns/nrfx/bsp/stable/mdk/nrf7140_ml.svd
          <register>
            <name>CFGNLLUTO0M</name>
            <description>Offset Register For Lookup Table Entry 0</description>
            <addressOffset>0x16C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGNLLUTO0OFFSETM</name>
                <description>Offset value for lookup table entry 0. Used if input is less than compare point 1. Input is multiplied by slope value and added to this offset. two's complement format</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGNLLUTO1M</name>
            <description>Offset Register For Lookup Table Entry 1</description>
            <addressOffset>0x170</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGNLLUTO1OFFSETM</name>
                <description>Offset value for lookup table entry 1. Input is multiplied by slope value and added to this offset. two's complement format</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGNLOFFSET</name>
            <description>Shift Registerfor Lookup Table Offset Entries</description>
            <addressOffset>0x17C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGNLOFFSETSHIFT</name>
                <description>Shift amount for offset value in Lookup Table. Should be set to number of fractional bits (q format)</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>CFGNLOFFSETDIR</name>
                <description>Shift direction for offset value in Lookup Table</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SHIFTRIGHT</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SHIFTLEFT</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGNLLUTENABLE</name>
            <description>Enable Register For Lookup Table Entries</description>
            <addressOffset>0x180</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGNLLUTENABLEEN</name>
                <description>When 1, indicates corresponding lookup table entry is valid. When 0, indicates corresponding lookup table entry is invalid</description>
                <lsb>0</lsb>
                <msb>8</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGNLLUTC1</name>
            <description>Compare Register For Lookup Table Entry 1</description>
            <addressOffset>0x184</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGNLLUTC1COMPARE</name>
                <description>Compare value for lookup table entry 1. Input is compared to this value and if it matches (greater than or equal to this value and less than next entry value) the corresponding values of slope and intercept are used. two's complement format</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGNLLUTC2</name>
            <description>Compare Register For Lookup Table Entry 2</description>
            <addressOffset>0x188</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGNLLUTC2COMPARE</name>
                <description>Compare value for lookup table entry 2. Input is compared to this value and if it matches (greater than or equal to this value and less than next entry value) the corresponding values of slope and intercept are used. two's complement format</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGNLLUTC3</name>
            <description>Compare Register For Lookup Table Entry 3</description>
            <addressOffset>0x18C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGNLLUTC3COMPARE</name>
                <description>Compare value for lookup table entry 3. Input is compared to this value and if it matches (greater than or equal to this value and less than next entry value) the corresponding values of slope and intercept are used. two's complement format</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGNLLUTC4</name>
            <description>Compare Register For Lookup Table Entry 4</description>
            <addressOffset>0x190</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGNLLUTC4COMPARE</name>
                <description>Compare value for lookup table entry 4. Input is compared to this value and if it matches (greater than or equal to this value and less than next entry value) the corresponding values of slope and intercept are used. two's complement format</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGNLLUTC5</name>
            <description>Compare Register For Lookup Table Entry 5</description>
            <addressOffset>0x194</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGNLLUTC5COMPARE</name>
                <description>Compare value for lookup table entry 5. Input is compared to this value and if it matches (greater than or equal to this value and less than next entry value) the corresponding values of slope and intercept are used. two's complement format</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGNLLUTC6</name>
            <description>Compare Register For Lookup Table Entry 6</description>
            <addressOffset>0x198</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGNLLUTC6COMPARE</name>
                <description>Compare value for lookup table entry 6. Input is compared to this value and if it matches (greater than or equal to this value and less than next entry value) the corresponding values of slope and intercept are used. two's complement format</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGNLLUTC7</name>
            <description>Compare Register For Lookup Table Entry 7</description>
            <addressOffset>0x19C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGNLLUTC7COMPARE</name>
                <description>Compare value for lookup table entry 7. Input is compared to this value and if it matches (greater than or equal to this value and less than next entry value) the corresponding values of slope and intercept are used. two's complement format</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGNLLUTC8</name>
            <description>Compare Register For Lookup Table Entry 8</description>
            <addressOffset>0x1A0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGNLLUTC8COMPARE</name>
                <description>Compare value for lookup table entry 8. Input is compared to this value and if it matches (greater than or equal to this value and less than next entry value) the corresponding values of slope and intercept are used. two's complement format</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGNLLUTM0</name>
            <description>Slope Register For Lookup Table Entry 0</description>
            <addressOffset>0x1A4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGNLLUTM0SLOPE</name>
                <description>Slope value for lookup table entry 0. Used if input is less than compare point 1. Input is multiplied by this slope value and added to offset. two's complement format</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGNLLUTM1</name>
            <description>Slope Register For Lookup Table Entry 1</description>
            <addressOffset>0x1A8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGNLLUTM1SLOPE</name>
                <description>Slope value for lookup table entry 1. Input is multiplied by this slope value and added to offset. two's complement format</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGNLLUTM2</name>
            <description>Slope Register For Lookup Table Entry 2</description>
            <addressOffset>0x1AC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGNLLUTM2SLOPE</name>
                <description>Slope value for lookup table entry 2. Input is multiplied by this slope value and added to offset. two's complement format</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGNLLUTM3</name>
            <description>Slope Register For Lookup Table Entry 3</description>
            <addressOffset>0x1B0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGNLLUTM3SLOPE</name>
                <description>Slope value for lookup table entry 3. Input is multiplied by this slope value and added to offset. two's complement format</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGNLLUTM4</name>
            <description>Slope Register For Lookup Table Entry 4</description>
            <addressOffset>0x1B4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGNLLUTM4SLOPE</name>
                <description>Slope value for lookup table entry 4. Input is multiplied by this slope value and added to offset. two's complement format</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGNLLUTM5</name>
            <description>Slope Register For Lookup Table Entry 5</description>
            <addressOffset>0x1B8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGNLLUTM5SLOPE</name>
                <description>Slope value for lookup table entry 5. Input is multiplied by this slope value and added to offset. two's complement format</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGNLLUTM6</name>
            <description>Slope Register For Lookup Table Entry 6</description>
            <addressOffset>0x1BC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGNLLUTM6SLOPE</name>
                <description>Slope value for lookup table entry 6. Input is multiplied by this slope value and added to offset. two's complement format</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGNLLUTM7</name>
            <description>Slope Register For Lookup Table Entry 7</description>
            <addressOffset>0x1C0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGNLLUTM7SLOPE</name>
                <description>Slope value for lookup table entry 7. Input is multiplied by this slope value and added to offset. two's complement format</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGNLLUTM8</name>
            <description>Slope Register For Lookup Table Entry 8</description>
            <addressOffset>0x1C4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGNLLUTM8SLOPE</name>
                <description>Slope value for lookup table entry 8. Input is multiplied by this slope value and added to offset. two's complement format</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGNLLUTO0</name>
            <description>Offset Register For Lookup Table Entry 0</description>
            <addressOffset>0x1C8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGNLLUTO0OFFSET</name>
                <description>Offset value for lookup table entry 0. Used if input is less than compare point 1. Input is multiplied by slope value and added to this offset. two's complement format</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGNLLUTO1</name>
            <description>Offset Register For Lookup Table Entry 1</description>
            <addressOffset>0x1CC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGNLLUTO1OFFSET</name>
                <description>Offset value for lookup table entry 1. Input is multiplied by slope value and added to this offset. two's complement format</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGNLLUTO2</name>
            <description>Offset Register For Lookup Table Entry 2</description>
            <addressOffset>0x1D0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGNLLUTO2OFFSET</name>
                <description>Offset value for lookup table entry 2. Input is multiplied by slope value and added to this offset. two's complement format</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGNLLUTO3</name>
            <description>Offset Register For Lookup Table Entry 3</description>
            <addressOffset>0x1D4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGNLLUTO3OFFSET</name>
                <description>Offset value for lookup table entry 3. Input is multiplied by slope value and added to this offset. two's complement format</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGNLLUTO4</name>
            <description>Offset Register For Lookup Table Entry 4</description>
            <addressOffset>0x1D8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGNLLUTO4OFFSET</name>
                <description>Offset value for lookup table entry 4. Input is multiplied by slope value and added to this offset. two's complement format</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGNLLUTO5</name>
            <description>Offset Register For Lookup Table Entry 5</description>
            <addressOffset>0x1DC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGNLLUTO5OFFSET</name>
                <description>Offset value for lookup table entry 5. Input is multiplied by slope value and added to this offset. two's complement format</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGNLLUTO6</name>
            <description>Offset Register For Lookup Table Entry 6</description>
            <addressOffset>0x1E0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGNLLUTO6OFFSET</name>
                <description>Offset value for lookup table entry 6. Input is multiplied by slope value and added to this offset. two's complement format</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGNLLUTO7</name>
            <description>Offset Register For Lookup Table Entry 7</description>
            <addressOffset>0x1E4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGNLLUTO7OFFSET</name>
                <description>Offset value for lookup table entry 7. Input is multiplied by slope value and added to this offset. two's complement format</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGNLLUTO8</name>
            <description>Offset Register For Lookup Table Entry 8</description>
            <addressOffset>0x1E8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGNLLUTO8OFFSET</name>
                <description>Offset value for lookup table entry 8. Input is multiplied by slope value and added to this offset. two's complement format</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
