ankuns/nrfx/bsp/stable/mdk/nrf7140_ml.svd
        <cluster>
          <name>AXON</name>
          <description>Unspecified</description>
          <headerStructName>AXONS_AXON</headerStructName>
          <access>read-write</access>
          <addressOffset>0xA00</addressOffset>
          <register>
            <name>CFGDESCCMDTYPERB</name>
            <description>Read Back for desc[0].  General configuration register for 1000_AXON, desc[0] is manily to set the command type</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGCMD</name>
                <description>currently it is 5bits [4:0], specify a required operation to be executed. In the notation used below, capital letters (O,X,Y) represent vectors while small letters (o,a,b) represent scalars. When the output is a vector (O) it is written to memory, when the output is scallar (o) is is available in the accumulator status register (which can optionally be written to memory by setting cfg_write_acc in descriptor.)</description>
                <lsb>0</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OPNOP</name>
                    <description>Unspecified</description>
                    <value>0x00</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPFFT</name>
                    <description>Unspecified</description>
                    <value>0x01</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPMAR</name>
                    <description>Unspecified</description>
                    <value>0x02</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPFIR</name>
                    <description>Unspecified</description>
                    <value>0x03</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPFIRX</name>
                    <description>Unspecified</description>
                    <value>0x04</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPNORM</name>
                    <description>Unspecified</description>
                    <value>0x05</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPAXPBY</name>
                    <description>Unspecified</description>
                    <value>0x06</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPACC</name>
                    <description>Unspecified</description>
                    <value>0x08</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPXPY</name>
                    <description>Unspecified</description>
                    <value>0x09</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPXMY</name>
                    <description>Unspecified</description>
                    <value>0x0A</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPAXPB</name>
                    <description>Unspecified</description>
                    <value>0x0B</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPACORR</name>
                    <description>Unspecified</description>
                    <value>0x0C</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPXSPYS</name>
                    <description>Unspecified</description>
                    <value>0x0D</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPXSMYS</name>
                    <description>Unspecified</description>
                    <value>0x0E</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPSQRT</name>
                    <description>Unspecified</description>
                    <value>0x0F</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPLOG</name>
                    <description>Unspecified</description>
                    <value>0x10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPEXP</name>
                    <description>Unspecified</description>
                    <value>0x11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPXTY</name>
                    <description>Unspecified</description>
                    <value>0x12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPXS</name>
                    <description>Unspecified</description>
                    <value>0x13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPPREFETCH</name>
                    <description>Unspecified</description>
                    <value>0x14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPMARX</name>
                    <description>Unspecified</description>
                    <value>0x16</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CFGFFTTAP</name>
                <description>Data TAP size, 512=3'b001,256=3'b010,128=3'b011,64=3'b100,32=3'b101.</description>
                <lsb>8</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>CFGSAMPLESIZE</name>
                <description>12 bits, sample size is up to 2048 (12'b100_0000_0000).</description>
                <lsb>16</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>CFGACC32</name>
                <description>When 1, and cfg_write_acc and cfg_acc_pack are 1 the 32 bit accumulator is written into system memory. When 0, and cfg_write_acc and cfg_acc_pack are 1 the width of the accumulator written into system memory is determined by cfg_cu_data_width.</description>
                <lsb>29</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>CFGACCPACK</name>
                <description>When 1, and cfg_write_acc is 1 the accumulator packed in system memory according to data width cfg_cu_data_width and cfg_acc_32. When 0, and cfg_write_acc is 1 the 64bit accumulator is written into system memory.</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>CFGMEMPACK</name>
                <description>When 1, Samples are packed in system memory according to data width cfg_cu_data_width. When 0, each system memory will contain only one sample.</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGDESCCUSETRB</name>
            <description>Read Back Configuration register for the compute_unit in 1000_AXON</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGCUDATAWIDTH</name>
                <description>real width of data, 08_bit=2'b00,16_bit=2'b01,24_bit=2'b10,12_bit=2'b11.</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>CFGCUROUNDEN</name>
                <description>Rounding enable.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>CFGCUROUNDSIZE</name>
                <description>Rounding size. Rounding operation devides output by 2^cfg_cu_round_size. Then rounds up if remainder is more than 0.5 or remainder is exactly 0.5 and quotient is odd. Maximum supported cfg_cu_round_size is 32.</description>
                <lsb>8</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>CFGCUCLAMPEN</name>
                <description>Clamping enable. Enabling clamping will saturate outputs and accumulator at their maximum postivie incase of overflow or minimum negative values incase of underflow. The default size for the Accumulator is 64 bits and for outputs is 24 bits. When packing (cfg_mem_pack) is enabled, the size of the output is specified by cfg_cu_data_width. When the accumulator is packed (cfg_acc_pack) and written into memory (cfg_write_acc) the accumulator size is determined by cfg_acc_32 and cfg_cu_data_width.</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>CFGCURELUEN</name>
                <description>Relu function enable at the output of compute unit. The relu operation zeros out negative numbers. To perform only RELU, use the aX+b with a=1 and b=0</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>CFGWRITEACC</name>
                <description>Write value of 64bit accumulator into memory indicated by cfg_mem_q_addr. This should be used with coammnds that output the accumulator (ie ACC, MAR, MAR_S, L2NORM)</description>
                <lsb>20</lsb>
                <msb>20</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGDESCXADDRRB</name>
            <description>Read Back for X-block configuration register.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGDESCXADDR</name>
                <description>register address for X-block in SysMem. This address needs to be 16 byte algined when 8 bit packing is used, 8 byte aligned when 12/16 but packing issued and 4 byte aligned otherwise. Recommend to by 16 byte aligned to satisfy all modes.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGDESCXSIZERB</name>
            <description>X-block configuration register 2.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGMEMXNUM</name>
                <description>Effective number of samples in X-block, maximum 2048 12bits. Must by multiple of 4 for (FIR, FIR.X, L2NOM, ACC, MAR,MAR.X. Must be 1024 for ACORR. Must be multiple of 2 for other operations.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>CFGMEMXSTRIDE</name>
                <description>Stride value, currently it is 2 bits.</description>
                <lsb>16</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>CFGMEMXDATAWIDTH</name>
                <description>Data width for X block, when cfg_mem_x_data_width_enable is 1. Otherwise cfg_cu_data_width is used.</description>
                <lsb>20</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>CFGMEMXDATAWIDTHENABLE</name>
                <description>Enable use of X block specific data width. Allowed only for MAR operation.</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>CFGMEMXOFFSET</name>
                <description>Offset value</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGDESCYADDRRB</name>
            <description>Y-block configuration register 1.</description>
            <addressOffset>0x010</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGMEMYADDR</name>
                <description>First register address for Y-block in SysMem. This address needs to be 16 byte algined when 8 bit packing is used, 8 byte aligned when 12/16 but packing issued and 4 byte aligned otherwise. Recommend to by 16 byte aligned to satisfy all modes.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGDESCYSIZERB</name>
            <description>Y-block configuration register 2.</description>
            <addressOffset>0x014</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGMEMYNUM</name>
                <description>Effective number of samples in Y-block, maximum 2048 12bits. Must by multiple of 4 for (FIR, FIR.X, L2NOM, ACC, MAR,MAR.X. Must be 512 for ACORR. Must be multiple of 2 for other operations.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>CFGMEMYSTRIDE</name>
                <description>Stride value, currently it is 2 bits.</description>
                <lsb>16</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>CFGMEMYDATAWIDTH</name>
                <description>Data width for Y block, when cfg_mem_y_data_width_enable is 1. Otherwise cfg_cu_data_width is used.</description>
                <lsb>20</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>CFGMEMYDATAWIDTHENABLE</name>
                <description>Enable use of Y block specific data width. Allowed only for MAR operation.</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>CFGMEMYOFFSET</name>
                <description>Offset value</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGDESCAADDRRB</name>
            <description>A-block configuration register 1.</description>
            <addressOffset>0x018</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGAADDRRB</name>
                <description>First register address for A-block in SysMem. This should also be programmed to the delay value during Auto-Correlation comand (must be even value of delay).</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGDESCASIZERB</name>
            <description>A-block configuration register 2.</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGMEMANUM</name>
                <description>Effective number of samples in A-block, maximum 2048 12bits. This is a vector only for PREFETCH command. For all other command is a scalar (ie single value). Must be multiple of 2 for Auto-correlation command</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>CFGMEMASTRIDE</name>
                <description>Stride value, currently it is 2 bits.</description>
                <lsb>16</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>CFGMEMAOFFSET</name>
                <description>Offset value</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGDESCBADDRRB</name>
            <description>B-block configuration register 1.</description>
            <addressOffset>0x020</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGDESCBADDR</name>
                <description>First register address for B-block in SysMem.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGDESCBSIZERB</name>
            <description>B-block configuration register 2.</description>
            <addressOffset>0x024</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGMEMBNUM</name>
                <description>Effective number of samples in B-block, maximum 2048 12bits.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>CFGMEMBSTRIDE</name>
                <description>Stride value, currently it is 2 bits.</description>
                <lsb>16</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>CFGMEMBOFFSET</name>
                <description>Offset value</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGDESCQADDRRB</name>
            <description>Q-block configuration register 1.</description>
            <addressOffset>0x028</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGMEMQADDR</name>
                <description>First register address for Q-block in SysMem. This address needs to be 16 byte algined when 8 bit packing is used, 8 byte aligned when 12/16 but packing issued and 4 byte aligned otherwise. Recommend to by 16 byte aligned to satisfy all modes. When packing auumulator in memory (cfg_write_acc and cfg_acc_pack are 1), the address must be written in sequence (least signifcant two bits 0,1,2,3 for 8 bit packing  and  0,2 for 12/16 bit packing) to trigger writing the packed accumulator into memory.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGDESCQSIZERB</name>
            <description>Q-block configuration register 2.</description>
            <addressOffset>0x02C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGMEMQNUM</name>
                <description>Effective number of samples in Q-block, maximum 2048 12bits.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>CFGMEMQSTRIDE</name>
                <description>Stride value, currently it is 2 bits.</description>
                <lsb>16</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>CFGMEMQOFFSET</name>
                <description>Offset value</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGDESCXLOOPRB</name>
            <description>X-block offset loop configuration register.</description>
            <addressOffset>0x030</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGMEMXOFFSETLOOPEN</name>
                <description>Offset loop enable</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>CFGMEMXOFFSETLOOPSTART</name>
                <description>Offset loop start</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>CFGMEMXOFFSETLOOPSTEPSIZE</name>
                <description>Offset loop step size</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>CFGMEMXOFFSETLOOPEND</name>
                <description>Offset loop end</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGDESCYLOOPRB</name>
            <description>Y-block offset loop configuration register.</description>
            <addressOffset>0x034</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGMEMYOFFSETLOOPEN</name>
                <description>Offset loop enable</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>CFGMEMYOFFSETLOOPSTART</name>
                <description>Offset loop start</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>CFGMEMYOFFSETLOOPSTEPSIZE</name>
                <description>Offset loop step size</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>CFGMEMYOFFSETLOOPEND</name>
                <description>Offset loop end</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
