ankuns/nrfx/bsp/stable/mdk/nrf7140_ml.svd
          <register>
            <name>CFG2DESCCMDTYPERB</name>
            <description>Read Back for desc[0].  General configuration register for 1000_AXON, desc[0] is manily to set the command type</description>
            <addressOffset>0x038</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGTWOCMD</name>
                <description>Specifies second command to execute. Encoding is same as cfg_cmd.</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CFGTWOFFTTAP</name>
                <description>Data TAP size, 512=3'b001,256=3'b010,128=3'b011,64=3'b100,32=3'b101.</description>
                <lsb>8</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>CFGTWOSAMPLESIZE</name>
                <description>12 bits, sample size is up to 2048 (12'b100_0000_0000).</description>
                <lsb>16</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>CFGTWOBANKREVERSE</name>
                <description>Reverse TCM Bank.</description>
                <lsb>28</lsb>
                <msb>28</msb>
              </field>
              <field>
                <name>CFGTWOCMDENABLE</name>
                <description>Enable second command</description>
                <lsb>29</lsb>
                <msb>29</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFG2DESCCUSETRB</name>
            <description>Read Back Configuration register for the compute_unit in 1000_AXON</description>
            <addressOffset>0x03C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGTWOCUDATAWIDTH</name>
                <description>Second Command real width of data, 08_bit=2'b00,16_bit=2'b01,24_bit=2'b10,12_bit=2'b11.</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>CFGTWOCUROUNDEN</name>
                <description>Second Command Rounding enable.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>CFGTWOCUROUNDSIZE</name>
                <description>Second Command Rounding size.</description>
                <lsb>8</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>CFGTWOCUCLAMPEN</name>
                <description>Clamping enable.</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGCOREREQ</name>
            <description>core request register</description>
            <addressOffset>0x040</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>REQNEWCMDREADY</name>
                <description>Ready to execute a new command.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>REQAXONSTART</name>
                <description>Start Processing the queued descriptors</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>READSTSBITS</name>
                <description>Sample all the status bits which present at the input of Sync_sts cell.</description>
                <lsb>24</lsb>
                <msb>24</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STSVERSIONS</name>
            <description>AXON Version ID</description>
            <addressOffset>0x048</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000106</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STSAXONBRANCH</name>
                <description>AXON branch number</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>STSAXONREVISION</name>
                <description>AXON revision number</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>STSAXONVERSION</name>
                <description>AXON Version number.</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STSAHBADDRESS</name>
            <description>AXON AHB Master last access address</description>
            <addressOffset>0x050</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STSAHBHADDR</name>
                <description>The address of the last access preformed by AHB master. Must trigger read_sts_bits to update this field.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STSDMAADDRESS</name>
            <description>AXON DMA last access address</description>
            <addressOffset>0x054</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STSDMAHADDR</name>
                <description>The address of the last access preformedby DMA</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STSFSM</name>
            <description>Finite State Machines status register</description>
            <addressOffset>0x058</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STSFSMDESC</name>
                <description>State of descriptor statemachine</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>STATEIDLE</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEREADFIFO</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEREQ</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEWAITDESC</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATESTARTCORE</name>
                    <description>Unspecified</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEWAITCORE</name>
                    <description>Unspecified</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATECOREDONE</name>
                    <description>Unspecified</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEACCREQ</name>
                    <description>Unspecified</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEACCW0</name>
                    <description>Unspecified</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEACCW1</name>
                    <description>Unspecified</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEACCFLUSH</name>
                    <description>Unspecified</description>
                    <value>0xA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEFINISH</name>
                    <description>Unspecified</description>
                    <value>0xB</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEERR</name>
                    <description>Unspecified</description>
                    <value>0xC</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEACCCREQ</name>
                    <description>Unspecified</description>
                    <value>0xD</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEACCCW</name>
                    <description>Unspecified</description>
                    <value>0xE</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEACCCFILL</name>
                    <description>Unspecified</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>STSCNTRSTATE</name>
                <description>currently it is 5bits [11:7], Actual state machine in CNTR, used for debug.</description>
                <lsb>8</lsb>
                <msb>13</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CNTRRESET</name>
                    <description>Unspecified</description>
                    <value>0x00</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CNTRWAITCMD</name>
                    <description>Unspecified</description>
                    <value>0x01</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CNTRDMAINITB</name>
                    <description>Unspecified</description>
                    <value>0x02</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CNTRCMDDEC</name>
                    <description>Unspecified</description>
                    <value>0x03</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CNTRDMAINITY</name>
                    <description>Unspecified</description>
                    <value>0x04</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CNTRDMAWAITA</name>
                    <description>Unspecified</description>
                    <value>0x05</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CNTRDMAWAITB</name>
                    <description>Unspecified</description>
                    <value>0x06</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CNTRDMAINITA</name>
                    <description>Unspecified</description>
                    <value>0x07</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CNTRDMAWAITQ</name>
                    <description>Unspecified</description>
                    <value>0x08</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CNTRDMAINITQ</name>
                    <description>Unspecified</description>
                    <value>0x09</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CNTREXECINIT</name>
                    <description>Unspecified</description>
                    <value>0x0A</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CNTREXEC</name>
                    <description>Unspecified</description>
                    <value>0x0B</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CNTRDMAWAITY</name>
                    <description>Unspecified</description>
                    <value>0x0C</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CNTRDMAINITX</name>
                    <description>Unspecified</description>
                    <value>0x0D</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CNTREXECPREP</name>
                    <description>Unspecified</description>
                    <value>0x0E</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CNTRDMAWAITX</name>
                    <description>Unspecified</description>
                    <value>0x0F</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CNTRJOBDONE</name>
                    <description>Unspecified</description>
                    <value>0x18</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CNTRERROR</name>
                    <description>Unspecified</description>
                    <value>0x19</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>STSFSMARBAHB</name>
                <description>State of bus arbitor AHB interface satemachine. Must trigger read_sts_bits to update this field.</description>
                <lsb>16</lsb>
                <msb>19</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>STATEIDLE</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEREQ</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEWRITE</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEREAD</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATESWRITE</name>
                    <description>Unspecified</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATESWRITEREQ</name>
                    <description>Unspecified</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATESREAD</name>
                    <description>Unspecified</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATESREADREQ</name>
                    <description>Unspecified</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEERR</name>
                    <description>Unspecified</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEDUMMY0</name>
                    <description>Unspecified</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEDUMMY1</name>
                    <description>Unspecified</description>
                    <value>0xA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEDUMMY2</name>
                    <description>Unspecified</description>
                    <value>0xB</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEDUMMY3</name>
                    <description>Unspecified</description>
                    <value>0xC</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEDUMMY4</name>
                    <description>Unspecified</description>
                    <value>0xD</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEDUMMY5</name>
                    <description>Unspecified</description>
                    <value>0xE</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEDUMMY6</name>
                    <description>Unspecified</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>STSFSMARBCORE</name>
                <description>State of bus arbitor core interface statemachine</description>
                <lsb>20</lsb>
                <msb>21</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>STATEIDLE</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEWRITE</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEREAD</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEERR</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>STSFSMCACHE</name>
                <description>State of cache statemachine</description>
                <lsb>24</lsb>
                <msb>25</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>STATEIDLE</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEREQ</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEWRITE</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEREAD</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>STSFSMSLEEP</name>
                <description>State of sleep statemachine</description>
                <lsb>28</lsb>
                <msb>29</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>STATEACTIVE</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEINACTIVE</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATESLEEP</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STATEWAKEUP</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
