ankuns/nrfx/bsp/stable/mdk/nrf7140_ml.svd
          <register>
            <name>STSFIFO</name>
            <description>FIFO Level status register</description>
            <addressOffset>0x05C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STSRFIFOSIZE</name>
                <description>Number of entries used in Read data Fifo</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>STSRFIFOEMPTY</name>
                <description>Read data Fifo Empty indicator</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>STSRFIFOFULL</name>
                <description>Read data Fifo Full indicator. Must trigger read_sts_bits to update this field.</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>STSWFIFOSIZE</name>
                <description>Number of entries used in Write data Fifo</description>
                <lsb>8</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>STSWFIFOEMPTY</name>
                <description>Write data Fifo Empty indicator. Must trigger read_sts_bits to update this field.</description>
                <lsb>14</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>STSWFIFOFULL</name>
                <description>Write data Fifo Full indicator</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>STSCFIFOSIZE</name>
                <description>Number of entries used in Control Fifo</description>
                <lsb>16</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>STSCFIFOEMPTY</name>
                <description>Control Fifo Empty indicator. Must trigger read_sts_bits to update this field.</description>
                <lsb>22</lsb>
                <msb>22</msb>
              </field>
              <field>
                <name>STSCFIFOFULL</name>
                <description>Control Fifo Full indicator</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>STSDFIFOSIZE</name>
                <description>Number of entries used in Descriptor Fifo</description>
                <lsb>24</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>STSDFIFOEMPTY</name>
                <description>Descriptor Fifo Empty indicator</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>STSDFIFOFULL</name>
                <description>Descriptor Fifo Full indicator</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGCORESTAT1</name>
            <description>AXON status register 1</description>
            <addressOffset>0x060</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STSCUCMD</name>
                <description>currently it is 4bits [3:0], running operation in CU, used for debug.</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>STSCUACCWIDTH</name>
                <description>The width of ACC output 24bit=1'b0,32bit=1'b1.</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>STSDMAHTRANS</name>
                <description>The value of internal dma htrans[1]</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>STSDMAHREADY</name>
                <description>The value of internal dma hready</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>STSAHBHREADY</name>
                <description>The value of AHB master hready input. Must trigger read_sts_bits to update this field.</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>STSAHBHGRANT</name>
                <description>The value of AHB master hgrant input. Must trigger read_sts_bits to update this field.</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>STSAHBHRESP</name>
                <description>The value of AHB master hresp input. Must trigger read_sts_bits to update this field.</description>
                <lsb>11</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>STSAHBHBUSREQ</name>
                <description>The value of AHB master hbusreq output. Must trigger read_sts_bits to update this field.</description>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>STSAHBHTRANS</name>
                <description>The value of AHB master htrans output. Must trigger read_sts_bits to update this field.</description>
                <lsb>14</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>STSCNTRFREE</name>
                <description>The value of free entried in the read fifo.</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>STSASLEEP</name>
                <description>When logic 1, indicatesAXON is in sleep state. Any register write will wakeup AXON.</description>
                <lsb>24</lsb>
                <msb>24</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGCORESTAT2</name>
            <description>AXON status register 2</description>
            <addressOffset>0x064</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STSACCRESULT</name>
                <description>ACC output. This is accumulator[31:0]</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGCORESTAT3</name>
            <description>AXON status register 2 extended to 64.</description>
            <addressOffset>0x068</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STSACCRESULTE</name>
                <description>ACC output. This is accumulator[63:32]</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGCOREDESCSTARTADDR</name>
            <description>This register contains pointer to AXON descriptor, the value will be stored inside FIFO</description>
            <addressOffset>0x06C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DESCSTARTADDR</name>
                <description>start address of the descriptors in system memory.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGCORECURRDESCSTARTADDRRB</name>
            <description>current descriptor address readback</description>
            <addressOffset>0x070</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DESCADDRRB</name>
                <description>readback the current descriptor address</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGCORECTRL</name>
            <description>Configuration register for 0010_AXON</description>
            <addressOffset>0x074</addressOffset>
            <access>read-write</access>
            <resetValue>0x02000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGSOFTRESET</name>
                <description>Active high soft reset of the AXON IP. Does not reset configuration registers. Reset is performed asynchronously. Deassertion of reset is synchronoush and only takes a few cycles to propagate through synchrnonizers. Should be used to recover from any error interrupt by performing soft reset, then clearing all interrupts then retrying all descriptor batch.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NORMALOPERATION</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RESET</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CFGCOREDISABLE</name>
                <description>Active high clock gating. Does not gate off clock to LBI configuration registers to avoid lockup. This can be used to measure AXON leakage power in silicon when clocks are disabled.</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLOCKENABLED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLOCKDISABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CFGSTEPEN</name>
                <description>set 1 to enable FW to step each descriptor processed by triggering req_new_cmd_ready. set 0 so no FW involvement is needed per descriptor.</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>CFGWATCHDOGENHREADY</name>
                <description>set 1 to enable watchdog timer for receiving hready on AHB master port. set 0 to disable watchdog timer.</description>
                <lsb>20</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>CFGWATCHDOGENHGRANT</name>
                <description>set 1 to enable watchdog timer for receiving hgrant on AHB master port. set 0 to disable watchdog timer.</description>
                <lsb>21</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>CFGWATCHDOGENCMD</name>
                <description>set 1 to enable watchdog timer for processing each command. set 0 to disable watchdog timer.</description>
                <lsb>22</lsb>
                <msb>22</msb>
              </field>
              <field>
                <name>CFGWATCHDOGENDESC</name>
                <description>set 1 to enable watchdog timer for processing all the descriptors. set 0 to disable watchdog timer.</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>CFGMAXAHBBURST</name>
                <description>Specifies the maximum allowed burst size on the master AHB port.</description>
                <lsb>24</lsb>
                <msb>25</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NONE</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FOURBEATS</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EIGHTBEATS</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SIXTEENBEATS</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CFGSTOPONERR</name>
                <description>set 1, AXON will stop when an error is detected for FW to perform a sw reset using cfg_soft_reset. When 0, AXON statemachine will keep going when an error is detected.</description>
                <lsb>28</lsb>
                <msb>28</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGSLEEPCTRL</name>
            <description>Configuration register for Sleep Control</description>
            <addressOffset>0x078</addressOffset>
            <access>read-write</access>
            <resetValue>0x08006000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGINACTIVITYTIMER</name>
                <description>The umber of clock cycles of inactivity to wait before going to sleep</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>CFGWAKEUPTIMER</name>
                <description>AXON will wait for the number of progammed cycles after wakeup to allow clock to settle.</description>
                <lsb>24</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>CFGAUTOSLEEPEN</name>
                <description>When logic 1, The AXON will sleep if there is no commands to process for the duraction of the time specified by cfg_inactivity_timer. The axon will automatically wakeup if any registers are written. Register reads will leave the axon in sleep. When logic 0, AXON will not go into sleep mode.</description>
                <lsb>28</lsb>
                <msb>28</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGWATCHDOGCTRL</name>
            <description>Configuration register for Watchdog Control</description>
            <addressOffset>0x07C</addressOffset>
            <access>read-write</access>
            <resetValue>0x0FF0C810</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGWATCHDOGTIMERHREADY</name>
                <description>AXON will wait the programmed number of clock cyles to receive hready on AHB master port, otherwise the watchdog timer will expire and trigger an interrupt.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>CFGWATCHDOGTIMERHGRANT</name>
                <description>AXON will wait the programmed number of clock cyles to receive hgrant on AHB master port when requesting the bus, otherwise the watchdog timer will expire and trigger an interrupt.</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>CFGWATCHDOGTIMERCMD</name>
                <description>AXON will wait the programmed number of clock cyles (x 2^8) for a command to finish processing, otherwise the watchdog timer will expire and trigger an interrupt.</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>CFGWATCHDOGTIMERDESC</name>
                <description>AXON will wait the programmed number of clock cyles (x 2^16) for all the descriptos to finish processing, otherwise the watchdog timer will expire and trigger an interrupt.</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
