ankuns/nrfx/bsp/stable/mdk/nrf7140_ml.svd
          <register>
            <name>CFGINTRMASK</name>
            <description>Interupt enable register for AXON core</description>
            <addressOffset>0x080</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RESULTREADYINTE</name>
                <description>Enable generating interupt when AXON achieves any task and the results are ready to be read.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INTERRUPTDISABLED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INTERRUPTENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WATCHDOGTIMEOUTHREADYINTE</name>
                <description>Enable generating interupt when AXON watchdog timesout for receiving hready</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INTERRUPTDISABLED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INTERRUPTENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WATCHDOGTIMEOUTHGRANTINTE</name>
                <description>Enable generating interupt when AXON watchdog timesout for receiving hgrant</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INTERRUPTDISABLED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INTERRUPTENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WATCHDOGTIMEOUTCMDINTE</name>
                <description>Enable generating interupt when AXON watchdog timesout for processing a command</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INTERRUPTDISABLED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INTERRUPTENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WATCHDOGTIMEOUTDESCINTE</name>
                <description>Enable generating interupt when AXON watchdog timesout for processing all descriptors</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INTERRUPTDISABLED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INTERRUPTENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AHBSLAVESPLITINTE</name>
                <description>Enable generating interupt when AHB slave is telling the master to SPLIT</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INTERRUPTDISABLED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INTERRUPTENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AHBSLAVERETRYINTE</name>
                <description>Enable generating interupt when AHB slave is telling the master to RETRY</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INTERRUPTDISABLED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INTERRUPTENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AHBEARLYTERMINTE</name>
                <description>Enable generating interupt when AHB arbitor has terminated a burst early</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INTERRUPTDISABLED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INTERRUPTENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AXONFINISHEDINTE</name>
                <description>Enable generating interupt when AXON finished processing all queued descriptors</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INTERRUPTDISABLED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INTERRUPTENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AHBERRBURSTINTE</name>
                <description>Enable generating interupt when following AHB behavior occurs. The master didnt provide the complete data for the entire burst.</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INTERRUPTDISABLED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INTERRUPTENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AHBERRSLAVESPLITBADINTE</name>
                <description>Enable generating interupt when following AHB behavior occurs. The slave did not follow the AHB protocol when giving the HRESP SPLIT</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INTERRUPTDISABLED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INTERRUPTENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AHBERRSLAVERETRYBADINTE</name>
                <description>Enable generating interupt when following AHB behavior occurs. The slave did not follow the AHB protocol when giving the HRESP RETRY</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INTERRUPTDISABLED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INTERRUPTENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AHBERRSLAVEERRORBADINTE</name>
                <description>Enable generating interupt when following AHB behavior occurs. The slave did not follow the AHB protocol when giving the HRESP ERROR</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INTERRUPTDISABLED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INTERRUPTENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AHBSLAVEERRORINTE</name>
                <description>Enable generating interupt when following AHB behavior occurs. The slave is indicating an error has occurred with the access</description>
                <lsb>14</lsb>
                <msb>14</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INTERRUPTDISABLED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INTERRUPTENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AHBERRHRESPNOTOKINTE</name>
                <description>Enable generating interupt when following AHB behavior occurs.  The slave did not follow the AHB protocol and responded with HRESP not being OKAY when expected</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INTERRUPTDISABLED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INTERRUPTENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ERRQ0OFINTE</name>
                <description>Enable generating error Q0 overflow interupt.</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INTERRUPTDISABLED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INTERRUPTENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ERRQ124BOFINTE</name>
                <description>Enable generating error 24_bit Q1 output overflow interupt.</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INTERRUPTDISABLED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INTERRUPTENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ERRQ132BOFINTE</name>
                <description>Enable generating error 64_bit Accumualtor overflow interupt.</description>
                <lsb>18</lsb>
                <msb>18</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INTERRUPTDISABLED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INTERRUPTENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ERRQ2OFINTE</name>
                <description>Enable generating error Q2 overflow interupt.</description>
                <lsb>19</lsb>
                <msb>19</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INTERRUPTDISABLED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INTERRUPTENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ERRQ3OFINTE</name>
                <description>Enable generating error Q3 overflow interupt.</description>
                <lsb>20</lsb>
                <msb>20</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INTERRUPTDISABLED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INTERRUPTENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CACHEERRDMANOREQINTE</name>
                <description>Enable generating corresponding cache error interupt.</description>
                <lsb>21</lsb>
                <msb>21</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INTERRUPTDISABLED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INTERRUPTENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CACHEERRSTALERXFIFOINTE</name>
                <description>Enable generating corresponding cache error interupt.</description>
                <lsb>22</lsb>
                <msb>22</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INTERRUPTDISABLED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INTERRUPTENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CACHEERROVERLAPREQINTE</name>
                <description>Enable generating corresponding cache error interupt.</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INTERRUPTDISABLED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INTERRUPTENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RFIFOUDRINTE</name>
                <description>Enable generating Read data Fifo Underrun error interupt.</description>
                <lsb>24</lsb>
                <msb>24</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INTERRUPTDISABLED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INTERRUPTENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WFIFOUDRINTE</name>
                <description>Enable generating Write data Fifo Underrun error interupt.</description>
                <lsb>25</lsb>
                <msb>25</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INTERRUPTDISABLED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INTERRUPTENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CFIFOUDRINTE</name>
                <description>Enable generating Control Fifo Underrun error interupt.</description>
                <lsb>26</lsb>
                <msb>26</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INTERRUPTDISABLED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INTERRUPTENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DFIFOUDRINTE</name>
                <description>Enable generating Descriptor Fifo Underrun error interupt.</description>
                <lsb>27</lsb>
                <msb>27</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INTERRUPTDISABLED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INTERRUPTENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RFIFOOVRINTE</name>
                <description>Enable generating Read data Fifo Overun error interupt.</description>
                <lsb>28</lsb>
                <msb>28</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INTERRUPTDISABLED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INTERRUPTENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WFIFOOVRINTE</name>
                <description>Enable generating Write data Fifo Overun error interupt.</description>
                <lsb>29</lsb>
                <msb>29</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INTERRUPTDISABLED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INTERRUPTENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CFIFOOVRINTE</name>
                <description>Enable generating Control Fifo Overun error interupt.</description>
                <lsb>30</lsb>
                <msb>30</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INTERRUPTDISABLED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INTERRUPTENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DFIFOOVRINTE</name>
