ankuns/nrfx/bsp/stable/mdk/nrf7140_ml.svd
                <name>DFIFOOVRINT</name>
                <description>Descriptor Fifo Overrun error Interupt.</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOEVENT</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EVENT</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGINTRSTAT</name>
            <description>Interupt status register</description>
            <addressOffset>0x088</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RESULTREADYINTV</name>
                <description>Result_ready Interupt_V.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>WATCHDOGTIMEOUTHREADYINTV</name>
                <description>AHB master hready Watchdog timeout Interupt_V.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>WATCHDOGTIMEOUTHGRANTINTV</name>
                <description>AHB master hgrant Watchdog timeout Interupt_V.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>WATCHDOGTIMEOUTCMDINTV</name>
                <description>Command Watchdog timeout Interupt_V.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>WATCHDOGTIMEOUTDESCINTV</name>
                <description>Descriptor Watchdog timeout Interupt_V.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>AHBSLAVESPLITINTV</name>
                <description>AHB slave split Interupt_V.</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>AHBSLAVERETRYINTV</name>
                <description>AHB slave retry Interupt_V.</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>AHBEARLYTERMINTV</name>
                <description>AHB early termination Interupt_V.</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>AXONFINISHEDINTV</name>
                <description>AXON_Finished Interupt_V.</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>AHBERRBURSTINTV</name>
                <description>AHB error burst Interupt_V.</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>AHBERRSLAVESPLITBADINTV</name>
                <description>AHB error slave split bad Interupt_V.</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>AHBERRSLAVERETRYBADINTV</name>
                <description>AHB error slave retry bad Interupt_V.</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>AHBERRSLAVEERRORBADINTV</name>
                <description>AHB error slave error bad Interupt_V.</description>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>AHBSLAVEERRORINTV</name>
                <description>AHB Slave Error Interupt_V.</description>
                <lsb>14</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>AHBERRHRESPNOTOKINTV</name>
                <description>AHB Error HRESP not OK Interupt_V.</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>ERRQ0OFINTV</name>
                <description>Q0 overflow error Interupt_V. Tied off to 0</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>ERRQ124BOFINTV</name>
                <description>24-bit Q1 output overflow error Interupt_V.</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>ERRQ132BOFINTV</name>
                <description>64-bit Accumulator overflow error Interupt_V.</description>
                <lsb>18</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>ERRQ2OFINTV</name>
                <description>Q2 overflow error Interupt_V. Tied off to 0</description>
                <lsb>19</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>ERRQ3OFINTV</name>
                <description>Q3 overflow error Interupt_V. Tied off to 0</description>
                <lsb>20</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>CACHEERRDMANOREQINTV</name>
                <description>Cache DMA access without active request error Interupt_V.</description>
                <lsb>21</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>CACHEERRSTALERXFIFOINTV</name>
                <description>Cache stale data in recevie FIFO error Interupt_V.</description>
                <lsb>22</lsb>
                <msb>22</msb>
              </field>
              <field>
                <name>CACHEERROVERLAPREQINTV</name>
                <description>Cache overlap request error Interupt_V.</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>RFIFOUDRINTV</name>
                <description>Read data Fifo Underrun error Interupt_V.</description>
                <lsb>24</lsb>
                <msb>24</msb>
              </field>
              <field>
                <name>WFIFOUDRINTV</name>
                <description>Write data Fifo Underrun error Interupt_V.</description>
                <lsb>25</lsb>
                <msb>25</msb>
              </field>
              <field>
                <name>CFIFOUDRINTV</name>
                <description>Control Fifo Underrun error Interupt_V.</description>
                <lsb>26</lsb>
                <msb>26</msb>
              </field>
              <field>
                <name>DFIFOUDRINTV</name>
                <description>Descriptor Fifo Underrun error Interupt_V.</description>
                <lsb>27</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>RFIFOOVRINTV</name>
                <description>Read data Fifo Overrun error Interupt_V.</description>
                <lsb>28</lsb>
                <msb>28</msb>
              </field>
              <field>
                <name>WFIFOOVRINTV</name>
                <description>Write data Fifo Overrun error Interupt_V.</description>
                <lsb>29</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>CFIFOOVRINTV</name>
                <description>Control Fifo Overrun error Interupt_V.</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>DFIFOOVRINTV</name>
                <description>Descriptor Fifo Overrun error Interupt_V.</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGRAMCTRL</name>
            <description>22nm TSMC ram control register</description>
            <addressOffset>0x0C0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00011004</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGRAMEMA</name>
                <description>RAM setting to slow read access</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>CFGRAMEMAW</name>
                <description>Ram setting to slow write access</description>
                <lsb>4</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CFGRAMEMAS</name>
                <description>RAM setting to enable bitline keepr</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>CFGRAMWABLM</name>
                <description>Ram setting for write margin</description>
                <lsb>16</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>CFGRAMWABL</name>
                <description>Ram setting to enable write margin</description>
                <lsb>20</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>CFGRAMRAWLM</name>
                <description>Ram setting for read margin</description>
                <lsb>24</lsb>
                <msb>25</msb>
              </field>
              <field>
                <name>CFGRAMRAWL</name>
                <description>Ram setting to enable read margin</description>
                <lsb>28</lsb>
                <msb>28</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGPMON</name>
            <description>Performance Monitor Configuration Register</description>
            <addressOffset>0x0D0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGPMONMODE</name>
                <description>Performance Monitor Mode of Operation.</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FREERUNNING</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EVENTCOUNT</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EVENTLATENCY</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CFGPMONSELEVENT</name>
                <description>Select which event to count or measure latency</description>
                <lsb>8</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NUMINTERRUPTCYCLES</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NUMIDLECYCLES</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NUMBUSYCYCLES</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NUMFINISHEDBATCHES</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NUMDESCRIPTORS</name>
                    <description>Unspecified</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NUMDESCRIPTORFETCHCYCLES</name>
                    <description>Unspecified</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NUMDESCRIPTOREXECUTECYCLES</name>
                    <description>Unspecified</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NUMFLUSHOUTPUTCYCLES</name>
                    <description>Unspecified</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NUMWRITECYCLES</name>
                    <description>Unspecified</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NUMREADCYCLES</name>
                    <description>Unspecified</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NUMWRITEWAITCYCLES</name>
                    <description>Unspecified</description>
                    <value>0xA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NUMREADWAITCYCLES</name>
                    <description>Unspecified</description>
                    <value>0xB</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NUMFIRSTREADWAITCYCLES</name>
                    <description>Unspecified</description>
                    <value>0xC</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NUMRESTREADWAITCYCLES</name>
                    <description>Unspecified</description>
                    <value>0xD</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NUMBUSCYCLES</name>
                    <description>Unspecified</description>
                    <value>0xE</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NUMBUSWAITCYCLES</name>
                    <description>Unspecified</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CFGPMONAVERAGE</name>
                <description>Amount of averaging in latency measurement mode. Value is 2 ^ cfg_pmon_average. 0 means no averaging. 1 means average two measurements. 2 means average 4 measurements. 3 means average 8 measurments, and so on</description>
                <lsb>16</lsb>
                <msb>19</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>REQPMON</name>
            <description>Core Request Register</description>
            <addressOffset>0x0D4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>REQPMONTRIG</name>
                <description>Update sts_pmon_msb_cnt and sts_pmon_lsb_cnt. Not required in free running mode.</description>
                <lsb>28</lsb>
                <msb>28</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STSPMONMSB</name>
            <description>Performance Counter Most Significant Word</description>
            <addressOffset>0x0D8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STSPMONMSBCNT</name>
                <description>Perfromance counter bits 63 to 32. Must trigger req_core_pmon_trig to update, except in free running mode</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STSPMONLSB</name>
            <description>Performance Counter Least Significant Word</description>
            <addressOffset>0x0DC</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STSPMONLSBCNT</name>
                <description>Performance counter bits 31 to 0. Must trigger req_core_pmon_trig to update, except in free running mode</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>PCGCSLAVE</name>
          <description>Unspecified</description>
          <headerStructName>AXONS_PCGCSLAVE</headerStructName>
          <access>read-write</access>
          <addressOffset>0xF00</addressOffset>
          <register>
            <dim>0x2</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>PENALTY[%s]</name>
            <description>Description collection: Penalty level for power/clock pair n. When FULL_PCP_ZERO feature is not supported, PENALTY[0] address overlaps the PENALTY0 address and register description for PENALTY[0] is not valid.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFC</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PENALTY</name>
                <description>Penalty level</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PENALTY0</name>
            <description>Penalty level for power/clock pair 0. The register description is valid only when FULL_PCP_ZERO feature is not supported</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <alternateRegister>PENALTY[%s]</alternateRegister>
            <size>0x20</size>
            <fields>
              <field>
                <name>PENALTY</name>
                <description>Penalty level</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x2</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>FORCEOVERRIDE[%s]</name>
            <description>Description collection: Force override of power/clock pair n.</description>
            <addressOffset>0x80</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CLOCKFORCINGPRE</name>
                <description>CLOCKFORCINGPRE</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>DOFORCECLOCKPRE</name>
                <description>DOFORCECLOCKPRE</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>POWERFORCINGPRE</name>
                <description>POWERFORCINGPRE</description>
                <lsb>8</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>DOFORCEPOWERPRE</name>
                <description>DOFORCEPOWERPRE</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
        </cluster>
