ankuns/nrfx/bsp/stable/mdk/nrf7140_ml.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="PCGCS000">
      <name>PCGCS010</name>
      <description>PCGCSlave 1</description>
      <baseAddress>0x4A01B000</baseAddress>
    </peripheral>
    <peripheral>
      <name>ABB</name>
      <description>ABB peripheral</description>
      <baseAddress>0x4A01C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>ABB</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>TASKS_GETABBSTATUS</name>
          <description>Get ABB status</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_GETABBSTATUS</name>
              <description>Get ABB status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_ABBSTATUSREADY</name>
          <description>The ABB status is ready for read</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_ABBSTATUSREADY</name>
              <description>The ABB status is ready for read</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>Enable or disable interrupt</description>
          <addressOffset>0x300</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ABBSTATUSREADY</name>
              <description>Enable or disable interrupt for event ABBSTATUSREADY</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Enable interrupt</description>
          <addressOffset>0x304</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ABBSTATUSREADY</name>
              <description>Write '1' to enable interrupt for event ABBSTATUSREADY</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Disable interrupt</description>
          <addressOffset>0x308</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ABBSTATUSREADY</name>
              <description>Write '1' to disable interrupt for event ABBSTATUSREADY</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTPEND</name>
          <description>Pending interrupts</description>
          <addressOffset>0x30C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ABBSTATUSREADY</name>
              <description>Read pending status of interrupt for event ABBSTATUSREADY</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>ABB status</description>
          <addressOffset>0x400</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>OPPOINT</name>
              <description>The current ABB operating point</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OpPoint0V4</name>
                  <description>Operating point 0.4V</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OpPoint0V5</name>
                  <description>Operating point 0.5V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OpPoint0V6</name>
                  <description>Operating point 0.6V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OpPoint0V8</name>
                  <description>Operating point 0.8V</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EN</name>
              <description>The ABB enable status.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>ABB disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>ABB enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCKED</name>
              <description>The ABB lock status.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLocked</name>
                  <description>Not locked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Locked</name>
                  <description>Locked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUSABB</name>
          <description>ABB macro status</description>
          <addressOffset>0x404</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>STATUS</name>
              <description>ABB macro status.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUSANA</name>
          <description>Status of ABB macro output signals</description>
          <addressOffset>0x408</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>LOCKED</name>
              <description>Current value of the LOCKED signal from the ABB macro</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>STATUSVALID</name>
              <description>Current value of the STATUS_VALID signal from the ABB macro</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>CONFIG</name>
          <description>Unspecified</description>
          <headerStructName>ABB_CONFIG</headerStructName>
          <access>read-write</access>
          <addressOffset>0x410</addressOffset>
          <register>
            <name>CTRL1</name>
            <description>ABB control 1</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00809003</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MODE</name>
                <description>ABB operation mode</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Auto</name>
                    <description>Auto</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SinglePVTmonitor</name>
                    <description>Single PVT monitor readout (for test)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OpenLoop</name>
                    <description>Open loop PWM charge pump drive (for test)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ZBB</name>
                    <description>Zero bias charge pump mode. VNW and VPW tied to VSS</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TESTMODE</name>
                <description>Test mode</description>
                <lsb>2</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Normal</name>
                    <description>Normal operation</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TestPvtMon</name>
                    <description>PVT monitor test, Testclock switched to internal ripple counter</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CounterBist</name>
                    <description>Ripple counter bist mode</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>STATUSOUTSEL</name>
                <description>Status output select</description>
                <lsb>4</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Ringo</name>
                    <description>Ringo count value and calibration done flag</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Locked</name>
                    <description>Locked status information, preliminary feature debugging only</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Filter</name>
                    <description>Filter status information, preliminary feature debugging only</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Ring</name>
                    <description>Ring oscillator information, preliminary feature debugging only</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CHARGEPUMPSELEN</name>
                <description>Additional charge pump slices and thereby define the drive strength of the body
                  bias charge pump</description>
                <lsb>8</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoSlice</name>
                    <description>No addition slice enabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SecondSlice</name>
                    <description>Second slice enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ThirdSlice</name>
                    <description>Third slice anabled</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BothSlices</name>
                    <description>Second and third slice enabled</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CHARGEPUMPSELLOCK</name>
                <description>Charge pump stages enabled during lock-in</description>
                <lsb>10</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoSlice</name>
                    <description>No addition slice enabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SecondSlice</name>
                    <description>Second slice enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ThirdSlice</name>
                    <description>Third slice anabled</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BothSlices</name>
                    <description>Second and third slice enabled</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIMERCONFIGVAL</name>
                <description>Timer value that defines the length of one closed loop control cycle.</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CTRL4</name>
            <description>ABB control 4</description>
            <addressOffset>0xC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00010800</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CP</name>
                <description>Proportional path coefficient of the closed loop body bias controller.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>CI</name>
                <description>Integral path coefficient of the closed loop body bias controller.</description>
                <lsb>16</lsb>
                <msb>18</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VENDORCONFIG0</name>
            <description>Vendor config 0</description>
            <addressOffset>0x10</addressOffset>
            <access>read-write</access>
            <resetValue>0xB6000002</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CONFIG</name>
                <description>ABB vendor config register 0.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VENDORCONFIG1</name>
            <description>Vendor config 1</description>
            <addressOffset>0x14</addressOffset>
            <access>read-write</access>
            <resetValue>0x000120E7</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CONFIG</name>
                <description>ABB vendor config register 1.</description>
                <lsb>0</lsb>
                <msb>20</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>TRIM</name>
          <description>Unspecified</description>
          <headerStructName>ABB_TRIM</headerStructName>
          <access>read-write</access>
          <addressOffset>0x440</addressOffset>
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>RINGO[%s]</name>
            <description>Description collection: RINGO trim values for operation points</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RINGOTARGETVALP</name>
                <description>Target performance for VPW biased devices.</description>
                <lsb>0</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>RINGOTARGETVALN</name>
                <description>Target performance for VNW biased devices.</description>
                <lsb>16</lsb>
                <msb>28</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>LOCKRANGE[%s]</name>
            <description>Description collection: LOCKRANGE trim values for operation points</description>
            <addressOffset>0x20</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LOCKRANGELOWN</name>
                <description>Lock range low boundary for VNW biased devices.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>LOCKRANGEHIGHN</name>
                <description>Lock range high boundary for VNW biased devices.</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>LOCKRANGELOWP</name>
                <description>Lock range low boundary for VPW biased devices.</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>LOCKRANGEHIGHP</name>
                <description>Lock range high boundary for VPW biased devices.</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>PVTMONCYCLES[%s]</name>
            <description>Description collection: PVTMONCYCLES trim values for operation points</description>
            <addressOffset>0x30</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>These bits configure the internal monitor</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
        </cluster>
