ankuns/nrfx/bsp/stable/mdk/nrf7140_ml.svd
        <register>
          <name>MODE</name>
          <description>ABB control</description>
          <addressOffset>0x480</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>OPPOINT</name>
              <description>The ABB operating point.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Auto</name>
                  <description>The peripheral controls the operating point automatically based on request from the
                    master ABB controller.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OpPoint0V4</name>
                  <description>Force the operating point to 0.4V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OpPoint0V5</name>
                  <description>Force the operating point to 0.5V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OpPoint0V6</name>
                  <description>Force the operating point to 0.6V</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OpPoint0V8</name>
                  <description>Force the operating point to 0.8V</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ABBEN</name>
              <description>Enable ABB.</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Auto</name>
                  <description>The peripheral controls the ABB enable automatically based on request.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Force enable ABB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Force disable ABB</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>OVERRIDE</name>
          <description>Unspecified</description>
          <headerStructName>ABB_OVERRIDE</headerStructName>
          <access>read-write</access>
          <addressOffset>0x500</addressOffset>
          <register>
            <name>LOCKED</name>
            <description>Override the LOCKED signal from the analog module</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Current value of the signal</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the override</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Override is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Override is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>STATUSVALID</name>
            <description>Override the STATUS_VALID signal from the analog module</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Current value of the signal</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the override</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Override is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Override is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_LRCCONF300">
      <name>GLOBAL_LRCCONF310</name>
      <description>LRCCONF 1</description>
      <baseAddress>0x4901E000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
    </peripheral>
    <peripheral derivedFrom="LRCCONF000">
      <name>LRCCONF010</name>
      <description>LRCCONF 1</description>
      <baseAddress>0x4A01E000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_PCGCM300">
      <name>GLOBAL_PCGCM310</name>
      <description>PCGC Master 1</description>
      <baseAddress>0x4901F000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
    </peripheral>
    <peripheral derivedFrom="PCGCM000">
      <name>PCGCM010</name>
      <description>PCGC Master 1</description>
      <baseAddress>0x4A01F000</baseAddress>
    </peripheral>
    <peripheral>
      <name>BELLBOARD</name>
      <description>BELLBOARD APB registers</description>
      <baseAddress>0x4F09D000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>BELLBOARD_0</name>
        <value>96</value>
      </interrupt>
      <interrupt>
        <name>BELLBOARD_1</name>
        <value>97</value>
      </interrupt>
      <interrupt>
        <name>BELLBOARD_2</name>
        <value>98</value>
      </interrupt>
      <interrupt>
        <name>BELLBOARD_3</name>
        <value>99</value>
      </interrupt>
      <groupName>BELLBOARD</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <dim>0x20</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TASKS_TRIGGER[%s]</name>
          <description>Description collection: Task TRIGGER[n]</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_TRIGGER</name>
              <description>Task TRIGGER[n]</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x20</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>EVENTS_TRIGGERED[%s]</name>
          <description>Description collection: Event TRIGGERED[n]</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_TRIGGERED</name>
              <description>Event TRIGGERED[n]</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
