ankuns/nrfx/bsp/stable/mdk/nrf7140_ml.svd
        <cluster>
          <name>DMA</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_GSI_DMA</headerStructName>
          <access>read-write</access>
          <addressOffset>0x600</addressOffset>
          <cluster>
            <name>STATUS</name>
            <description>EasyVDMA status registers.</description>
            <headerStructName>GLOBAL_GSI_DMA_STATUS</headerStructName>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <name>BYTECOUNT</name>
              <description>Number of bytes sent or received during processing of current descriptor list</description>
              <addressOffset>0x000</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>BYTECOUNT</name>
                  <description>Number of bytes sent or received during processing of current descriptor list</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>ATTRIBUTE</name>
              <description>Latest job attribute being processed.</description>
              <addressOffset>0x004</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ATTRIBUTE</name>
                  <description>Latest job attribute being processed.</description>
                  <lsb>0</lsb>
                  <msb>5</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>ADDRESS</name>
              <description>Latest address being accessed.</description>
              <addressOffset>0x008</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ADDRESS</name>
                  <description>Latest address being accessed.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>JOBCOUNT</name>
              <description>Number of completed jobs in current descriptor list.</description>
              <addressOffset>0x00C</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>JOBCOUNT</name>
                  <description>Number of completed jobs in current descriptor list.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>BUSERROR</name>
              <description>AXI bus error status.</description>
              <addressOffset>0x010</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>BUSERROR</name>
                  <description>AXI bus error type</description>
                  <lsb>0</lsb>
                  <msb>2</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NoError</name>
                      <description>There are no errors.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ReadError</name>
                      <description>Error related to memory when reading joblist, or error related to memory/register when reading data.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ReadDecodeError</name>
                      <description>Error related to the joblist address when reading joblist, or error related to address when reading memory/register.</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>WriteError</name>
                      <description>Error related to memory/register when writing data.</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>WriteDecodeError</name>
                      <description>Error related to the memory/register address when writing data.</description>
                      <value>0x4</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>FIFO</name>
              <description>Data fifo status.</description>
              <addressOffset>0x014</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>RXFIFO</name>
                  <description>Memory-to-Peripheral direction data fifo status</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Empty</name>
                      <description>Fifo is empty.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NotEmpty</name>
                      <description>Fifo contains data.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Full</name>
                      <description>Fifo is full.</description>
                      <value>0x2</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>TXFIFO</name>
                  <description>Peripheral-to-Memory direction data fifo status</description>
                  <lsb>2</lsb>
                  <msb>3</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Empty</name>
                      <description>Fifo is empty.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NotEmpty</name>
                      <description>Fifo contains data.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Full</name>
                      <description>Fifo is full.</description>
                      <value>0x2</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>ACTIVE</name>
              <description>DMA activity state.</description>
              <addressOffset>0x018</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ACTIVE</name>
                  <description>DMA activity state.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Idle</name>
                      <description>DMA is in idle state.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Active</name>
                      <description>Data is being transferred.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>CONFIG</name>
            <description>General config registers</description>
            <headerStructName>GLOBAL_GSI_DMA_CONFIG</headerStructName>
            <access>read-write</access>
            <addressOffset>0x100</addressOffset>
            <register>
              <name>BUFFERFILL</name>
              <description>Data to be used when data is sent with BufferFill attribute</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>BUFFERFILL</name>
                  <description>Data to be used when data is sent with BufferFill attribute</description>
                  <lsb>0</lsb>
                  <msb>7</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>LISTPTR</name>
              <description>Start address of descriptor list</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>LISTPTR</name>
                  <description>Start address of descriptor list</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>LISTPARTTHRESH</name>
              <description>Threshold value for generating event EVENTS_DONE.PARTLIST when descriptor list is partially completed. Value is number of jobs.</description>
              <addressOffset>0x008</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>LISTPARTTHRESH</name>
                  <description>Threshold value.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
        <cluster>
          <name>PCGCSLAVE</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_GSI_PCGCSLAVE</headerStructName>
          <access>read-write</access>
          <addressOffset>0xF00</addressOffset>
          <register>
            <dim>0x2</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>PENALTY[%s]</name>
            <description>Description collection: Penalty level for power/clock pair n. When FULL_PCP_ZERO feature is not supported, PENALTY[0] address overlaps the PENALTY0 address and register description for PENALTY[0] is not valid.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFC</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PENALTY</name>
                <description>Penalty level</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PENALTY0</name>
            <description>Penalty level for power/clock pair 0. The register description is valid only when FULL_PCP_ZERO feature is not supported</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <alternateRegister>PENALTY[%s]</alternateRegister>
            <size>0x20</size>
            <fields>
              <field>
                <name>PENALTY</name>
                <description>Penalty level</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x2</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>FORCEOVERRIDE[%s]</name>
            <description>Description collection: Force override of power/clock pair n.</description>
            <addressOffset>0x80</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CLOCKFORCINGPRE</name>
                <description>CLOCKFORCINGPRE</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>DOFORCECLOCKPRE</name>
                <description>DOFORCECLOCKPRE</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>POWERFORCINGPRE</name>
                <description>POWERFORCINGPRE</description>
                <lsb>8</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>DOFORCEPOWERPRE</name>
                <description>DOFORCEPOWERPRE</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>DSI</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_GSI_DSI</headerStructName>
          <access>read-write</access>
          <addressOffset>0x1000</addressOffset>
          <register>
            <name>VERSION</name>
            <description>Contains the version of the DSI host controller.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x30313531</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VERSION</name>
                <description>This field indicates the version of the DSI.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PWRUP</name>
            <description>Controls the power up of the controller.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SHUTDOWNZ</name>
                <description>This bit configures the controller either to power up or to reset.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>RESET</name>
                    <description>Reset the controller</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>POWERUP</name>
                    <description>Power up the controller</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CLKMGRCFG</name>
            <description>Configures the factor for internal dividers to divide lanebyteclk for timeout purposes.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TXESCCLKDIVISION</name>
                <description>This field indicates the division factor for the TX Escape clock source (lanebyteclk). The values 0 and 1 stop the TX_ESC clock generation.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>TOCLKDIVISION</name>
                <description>This field indicates the division factor for the Time Out clock used as the timing unit in the configuration of high-speed to low-power and low-power to high-speed transition error.</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DPIVCID</name>
            <description>Configures the Virtual Channel ID for DPI traffic.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DPIVCID</name>
                <description>This field configures the DPI virtual channel id that is indexed to the Video mode packets.</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DPICOLORCODING</name>
            <description>Configures DPI color coding.</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DPICOLORCODING</name>
                <description>This field configures the DPI color for Video Mode/eDPI Command Mode coding as follows:</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CC00</name>
                    <description>16-bit configuration 1</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC01</name>
                    <description>16-bit configuration 2</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC02</name>
                    <description>16-bit configuration 3</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC03</name>
                    <description>18-bit configuration 1</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC04</name>
                    <description>18-bit configuration 2</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC05</name>
                    <description>24-bit</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC06</name>
                    <description>20-bit YCbCr 4:2:2 loosely packed / Reserved for eDPI Command Mode</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC07</name>
                    <description>24-bit YCbCr 4:2:2 / Reserved for eDPI Command Mode</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC08</name>
                    <description>16-bit YCbCr 4:2:2 / Reserved for eDPI Command Mode</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC09</name>
                    <description>30-bit - DSC_ENC 10bit / Reserved for eDPI Command Mode</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC10</name>
                    <description>36-bit / Reserved for eDPI Command Mode</description>
                    <value>0xA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC11</name>
                    <description>12-bit YCbCr 4:2:0 / Reserved for eDPI Command Mode</description>
                    <value>0xB</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC12</name>
                    <description>DSC24 compressed Data</description>
                    <value>0xC</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC13</name>
                    <description>Unspecified</description>
                    <value>0xD</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC14</name>
                    <description>Unspecified</description>
                    <value>0xE</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC15</name>
                    <description>Unspecified</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LOOSELY18EN</name>
                <description>When set to 1, this bit activates loosely packed variant to 18-bit configurations.</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
            </fields>
          </register>
