ankuns/nrfx/bsp/stable/mdk/nrf7140_ml.svd
          <register>
            <name>DPICFGPOL</name>
            <description>Configures the polarity of DPI signals.</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATAENACTIVELOW</name>
                <description>When set to 1, this bit configures the data enable pin (dpidataen) as active low.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>VSYNCACTIVELOW</name>
                <description>When set to 1, this bit configures the vertical synchronism pin (dpivsync) as active low.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>HSYNCACTIVELOW</name>
                <description>When set to 1, this bit configures the horizontal synchronism pin (dpihsync) as active low.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>SHUTDACTIVELOW</name>
                <description>When set to 1, this bit configures the shutdown pin (dpishutdn) as active low.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>COLORMACTIVELOW</name>
                <description>When set to 1, this bit configures the color mode pin (dpicolorm) as active low.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DPILPCMDTIM</name>
            <description>Configures the timing for low-power commands sent while in video mode.</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INVACTLPCMDTIME</name>
                <description>This field is used for the transmission of commands in low-power mode. It defines the size, in bytes, of the largest packet that can fit in a line during the VACT region.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>OUTVACTLPCMDTIME</name>
                <description>This field is used for the transmission of commands in low-power mode. It defines the size, in bytes, of the largest packet that can fit in a line during the VSA, VBP, and VFP regions.</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DBIVCID</name>
            <description>Configures Virtual Channel ID for DBI traffic.</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DBIVCID</name>
                <description>This field configures the virtual channel id that is indexed to the DCS packets from DBI.</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DBICFG</name>
            <description>Configures the bit width of pixels for DBI.</description>
            <addressOffset>0x020</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INDBICONF</name>
                <description>This field configures the DBI input pixel data as follows:</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PIXELDATA0</name>
                    <description>8-bit 8 bpp</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIXELDATA1</name>
                    <description>8-bit 12 bpp</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIXELDATA2</name>
                    <description>8-bit 16 bpp</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIXELDATA3</name>
                    <description>8-bit 18 bpp</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIXELDATA4</name>
                    <description>8-bit 24 bpp</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIXELDATA5</name>
                    <description>9-bit 18 bpp</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIXELDATA6</name>
                    <description>16-bit 8 bpp</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIXELDATA7</name>
                    <description>16-bit 12 bpp</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIXELDATA8</name>
                    <description>16-bit 16 bpp</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIXELDATA9</name>
                    <description>16-bit 18 bpp, option 1</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIXELDATA10</name>
                    <description>16-bit 18 bpp, option 2</description>
                    <value>0xA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIXELDATA11</name>
                    <description>16-bit 24 bpp, option 1</description>
                    <value>0xB</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIXELDATA12</name>
                    <description>16-bit 24 bpp, option 2</description>
                    <value>0xC</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OUTDBICONF</name>
                <description>This field configures the DBI output pixel data as follows:</description>
                <lsb>8</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PIXELDATA0</name>
                    <description>8-bit 8 bpp</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIXELDATA1</name>
                    <description>8-bit 12 bpp</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIXELDATA2</name>
                    <description>8-bit 16 bpp</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIXELDATA3</name>
                    <description>8-bit 18 bpp</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIXELDATA4</name>
                    <description>8-bit 24 bpp</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIXELDATA5</name>
                    <description>9-bit 18 bpp</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIXELDATA6</name>
                    <description>16-bit 8 bpp</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIXELDATA7</name>
                    <description>16-bit 12 bpp</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIXELDATA8</name>
                    <description>16-bit 16 bpp</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIXELDATA9</name>
                    <description>16-bit 18 bpp, option 1</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIXELDATA10</name>
                    <description>16-bit 18 bpp, option 2</description>
                    <value>0xA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIXELDATA11</name>
                    <description>16-bit 24 bpp, option 1</description>
                    <value>0xB</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIXELDATA12</name>
                    <description>16-bit 24 bpp, option 2</description>
                    <value>0xC</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LUTSIZECONF</name>
                <description>This field configures the size used to transport the Write Lut commands as follows:</description>
                <lsb>16</lsb>
                <msb>17</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LUTSIZE0</name>
                    <description>16-bit color display</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LUTSIZE1</name>
                    <description>18-bit color display</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LUTSIZE2</name>
                    <description>24-bit color display</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LUTSIZE3</name>
                    <description>32-bit color display</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DBIPARTITIONINGEN</name>
            <description>Configures whether DSI is to partition DBI traffic automatically.</description>
            <addressOffset>0x024</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PARTITIONINGEN</name>
                <description>When set to 1, this bit enables the use of write_memory_continue input commands (system needs to ensure correct partitioning of Long Write commands). When not set, partitioning is automatically performed in the DSI.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DBICMZE</name>
            <description>Configures the command size and the size for automatic partitioning of DBI packets.</description>
            <addressOffset>0x028</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WRCMDSIZE</name>
                <description>This field configures the size of the DCS write memory commands. The size of DSI packet payload is the actual payload size minus 1, because the DCS command is in the DSI packet payload.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>ALLOWEDCMDSIZE</name>
                <description>This field configures the maximum allowed size for a DCS write memory command. This field is used to partition a write memory command into one write_memory_start and a variable number of write_memory_continue commands. It is only used if the partitioning_en bit of the DBI_CFG register is disabled. The size of the DSI packet payload is the actual payload size minus 1, because the DCS command is in the DSI packet payload.</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PCKHDLCFG</name>
            <description>Configures how EoTp, BTA, CRC and ECC are to be used, to meet peripherals characteristics</description>
            <addressOffset>0x02C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>EOTPTXEN</name>
                <description>When set to 1, this bit enables the EoTp transmission in high-speed.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>EOTPRXEN</name>
                <description>When set to 1, this bit enables the EoTp reception.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>BTAEN</name>
                <description>When set to 1, this bit enables the Bus Turn-Around (BTA) request.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>ECCRXEN</name>
                <description>When set to 1, this bit enables the ECC reception, error correction, and reporting.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>CRCRXEN</name>
                <description>When set to 1, this bit enables the CRC reception and error reporting.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>EOTPTXLPEN</name>
                <description>When set to 1, this bit enables the EoTp transmission in low-power.</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GENVCID</name>
            <description>Configures the Virtual Channel ID of READ responses to store and return to Generic interface.</description>
            <addressOffset>0x030</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>GENVCIDRX</name>
                <description>This field indicates the Generic interface read-back virtual channel identification.</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>GENVCIDTEARAUTO</name>
                <description>This field indicates the virtual channel identification for tear effect by hardware</description>
                <lsb>8</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>GENVCIDTXAUTO</name>
                <description>This field indicates the Generic interface virtual channel identification where generic packet is automatically generated &amp;amp; transmitted.</description>
                <lsb>16</lsb>
                <msb>17</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MODECFG</name>
            <description>Configures the mode of operation between Video or Command Mode. (Commands can still be sent while in video mode.)</description>
            <addressOffset>0x034</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CMDVIDEOMODE</name>
                <description>This bit configures the operation mode:</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>VIDMODE</name>
                    <description>video mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CMDMODE</name>
                    <description>command mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>VIDMODECFG</name>
            <description>Configures several aspects of Video mode operation, the transmission mode, switching to low-power in the middle of a frame, enabling acknowledge and whether to send commands in low-power.</description>
            <addressOffset>0x038</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VIDMODETYPE</name>
                <description>This field indicates the video mode transmission type as follows:</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>VIDMODE0</name>
                    <description>Non-burst with sync pulses</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VIDMODE1</name>
                    <description>Non-burst with sync events</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VIDMODE2</name>
                    <description>Burst mode</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VIDMODE3</name>
                    <description>Burst mode</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LPVSAEN</name>
                <description>When set to 1, this bit enables the return to low-power inside the VSA period when timing allows.</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>LPVBPEN</name>
                <description>When set to 1, this bit enables the return to low-power inside the VBP period when timing allows.</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>LPVFPEN</name>
                <description>When set to 1, this bit enables the return to low-power inside the VFP period when timing allows.</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>LPVACTEN</name>
                <description>When set to 1, this bit enables the return to low-power inside the VACT period when timing allows.</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>LPHBPEN</name>
                <description>When set to 1, this bit enables the return to low-power inside the HBP period when timing allows.</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>LPHFPEN</name>
                <description>When set to 1, this bit enables the return to low-power inside the HFP period when timing allows.</description>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>FRAMEBTAACKEN</name>
                <description>When set to 1, this bit enables the request for an acknowledge response at the end of a frame.</description>
                <lsb>14</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>LPCMDEN</name>
                <description>When set to 1, this bit enables the command transmission only in low-power mode.</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>VPGEN</name>
                <description>When set to 1, this bit enables the video mode pattern generator.</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>VPGMODE</name>
                <description>This field is to select the pattern:</description>
                <lsb>20</lsb>
                <msb>20</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>COLORBAR</name>
                    <description>horizontal or vertical</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BERPATTERN</name>
                    <description>vertical only</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VPGORIENTATION</name>
                <description>This field indicates the color bar orientation as follows:</description>
                <lsb>24</lsb>
                <msb>24</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>VPGORENT0</name>
                    <description>Vertical mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VPGORENT1</name>
                    <description>Horizontal mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
