ankuns/nrfx/bsp/stable/mdk/nrf7140_ml.svd
          <register>
            <name>GPUGREINIT</name>
            <description>Green (G) value of the STARTXY pixel. The value is 16,16 fixed point</description>
            <addressOffset>0x1C4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INIT</name>
                <description>Specifies the Green (G) value of the STARTXY pixel</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUBLUINIT</name>
            <description>Blue (B) value of the STARTXY pixel. The value is 16,16 fixed point</description>
            <addressOffset>0x1C8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INIT</name>
                <description>Specifies the Blue (B) value of the STARTXY pixel</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUALFINIT</name>
            <description>Alpha (A) value of the STARTXY pixel. The value is 16,16 fixed point</description>
            <addressOffset>0x1CC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INIT</name>
                <description>Specifies the Alpha (A) value of the STARTXY pixel</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUROPBLENDERBLENDMODE</name>
            <description>Blending Modes for different calculations between the source</description>
            <addressOffset>0x1D0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SOURCE</name>
                <description>Blending mode of the current pixel (source pixel)</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>GPUROPBLENDERBLENDMODEPOS04LEN04</name>
                <lsb>4</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>DEST</name>
                <description>Blending mode of the stored pixel in the FrameBuffer (destination pixel)</description>
                <lsb>8</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>GPUROPBLENDERBLENDMODEPOS12LEN04</name>
                <lsb>12</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>ANTIALIASING</name>
                <description>If set, disables Antialiasing</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>GPUROPBLENDERBLENDMODEPOS17LEN08</name>
                <lsb>17</lsb>
                <msb>24</msb>
              </field>
              <field>
                <name>BLDOFF</name>
                <description>If set, enables Negative Destination Color Keying.</description>
                <lsb>25</lsb>
                <msb>25</msb>
              </field>
              <field>
                <name>GPUROPBLENDERBLENDMODEPOS26LEN04</name>
                <lsb>26</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>CLKEYSRC</name>
                <description>If set, enables Source Color Keying</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>CLKEYDST</name>
                <description>If set, enables Destination Color Keying</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUROPBLENDERDSTCKEY</name>
            <description>When Color Keying is enabled. The new pixel is written in the Frame Buffer,</description>
            <addressOffset>0x1D4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RED</name>
                <description>Specifies the Red (R) value</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>GREEN</name>
                <description>Specifies the Green (G) value</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>BLUE</name>
                <description>Specifies the Blue (B) value</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Specifies the Alpha (A) value</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUROPBLENDERCONSTCOLOR</name>
            <description>Constant Color value which is used for blending when the blending modes.</description>
            <addressOffset>0x1D8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RED</name>
                <description>Specifies the Red (R) value</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>GREEN</name>
                <description>Specifies the Green (G) value</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>BLUE</name>
                <description>Specifies the Blue (B) value</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Specifies the Alpha (A) value</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUIPVERSION</name>
            <description>Returns the current GPU IP version</description>
            <addressOffset>0x1DC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00230600</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>UNEMAVERSION</name>
                <description>The current version of the GPU IP</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUCODEPTR2</name>
            <description>Shader code pointer</description>
            <addressOffset>0x1E0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FRG</name>
                <description>Specifies the pointer for the instruction that will be executed for the foreground pixels if we are working on neg_area geometries (rasterizer)</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>BCG</name>
                <description>Specifies the pointer for the instruction that will be executed for the background pixels if we are working on neg_area geometries (rasterizer)</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUIDREG</name>
            <description>GPU ID Register (fixed value)</description>
            <addressOffset>0x1EC</addressOffset>
            <access>read-write</access>
            <resetValue>0x86362000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IDREG</name>
                <description>The fixed value is 0x86362000</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUCONFIG</name>
            <description>GPU configuration status</description>
            <addressOffset>0x1F0</addressOffset>
            <access>read-write</access>
            <resetValue>0xF4030106</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>THREADS</name>
                <description>Indicates the log2 number of threads</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CORES</name>
                <description>Indicates the number of cores</description>
                <lsb>8</lsb>
                <msb>11</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>GPUCONFIGPOS12LEN04</name>
                <lsb>12</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CG</name>
                <description>When set to 1, indicates that clock gating is enabled</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>COMPRESS</name>
                <description>When set to 1, indicates that TSC compression mode is enabled</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>GPUCONFIGPOS18LEN08</name>
                <lsb>18</lsb>
                <msb>25</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DIRTY</name>
                <description>When set to 1, indicates that Dirty Region is enabled</description>
                <lsb>26</lsb>
                <msb>26</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ASYNC</name>
                <description>When set to 1, Bus to Memory is Asynchronous to core clock</description>
                <lsb>27</lsb>
                <msb>27</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BLENDER</name>
                <description>When set to 1, indicates that H/W Blender is enabled</description>
                <lsb>28</lsb>
                <msb>28</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>TSC6</name>
                <description>When set to 1, indicates that TSC6 compression mode is enabled.</description>
                <lsb>29</lsb>
                <msb>29</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BL</name>
                <description>When set to 1, indicates that Bilinear filtering is enabled</description>
                <lsb>30</lsb>
                <msb>30</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BUS</name>
                <description>When set to 1, indicates that the master bus is AXI</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUCONFIGH</name>
            <description>GPU configuration status (high bits)</description>
            <addressOffset>0x1F4</addressOffset>
            <access>read-write</access>
            <resetValue>0x000007C3</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AA</name>
                <description>Indicates that the Antialiasing feature is enabled</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DEC</name>
                <description>Indicates that the TSc Framebuffer/Texture Decompression is enabled</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CONFIGH10BIT</name>
                <description>Indicates that 10-bit precision is selected</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>GAMMA</name>
                <description>Indicates that Gamma Correction is enabled</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>YUVCOEF</name>
                <description>Indicates that YUV coefficients are present</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>TEXCHAN</name>
                <description>Indicates that Texture map unit has two channels</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>MBIST</name>
                <description>Indicates that separate logic/mem Clock Gating is enabled</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>GPFLAGS</name>
                <description>Indicates that external debug interface (GP_FLAG, SYSERROR_IRQ, FREEZE) is enabled</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>GPUCONFIGHRADFILL</name>
                <description>Indicates that Radial Fill is enabled</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>GPUCONFIGHVG</name>
                <description>Indicates that NemaVG is enabled</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>GPUCONFIGHTSC12</name>
                <description>When set to 1, indicates that TSC12 compression mode is enabled</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>GPUCONFIGHPOS11LEN21</name>
                <lsb>11</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUCORESELECT</name>
            <description>Select which of the available cores will be active</description>
            <addressOffset>0x1FC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DISABLECORE0</name>
                <description>set to deactivate core 0</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>DISABLECORE1</name>
                <description>set to deactivate core 1</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>DISABLECORE2</name>
                <description>set to deactivate core 2</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>DISABLECORE3</name>
                <description>set to deactivate core 3</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>GPUCORESELECTPOS04LEN28</name>
                <lsb>4</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUC0REG</name>
            <description>A 32-bit integer RGBA value is stored in constant register 0 for fragment calculations.</description>
            <addressOffset>0x200</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RED</name>
                <description>Specifies the Red (R) value</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Specifies the Green (G) value</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>BLUE</name>
                <description>Specifies the Blue (B) value</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Specifies the Alpha (A) value</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUC1REG</name>
            <description>A 32-bit integer RGBA value is stored in constant register 1 for fragment calculations.</description>
            <addressOffset>0x204</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RED</name>
                <description>Specifies the Red (R) value</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Specifies the Green (G) value</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>BLUE</name>
                <description>Specifies the Blue (B) value</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Specifies the Alpha (A) value</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUC2REG</name>
            <description>A 32-bit integer RGBA value is stored in constant register 2 for fragment calculations.</description>
            <addressOffset>0x208</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RED</name>
                <description>Specifies the Red (R) value</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Specifies the Green (G) value</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>BLUE</name>
                <description>Specifies the Blue (B) value</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Specifies the Alpha (A) value</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUC3REG</name>
            <description>A 32-bit integer RGBA value is stored in constant register 3 for fragment calculations.</description>
            <addressOffset>0x20C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RED</name>
                <description>Specifies the Red (R) value</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Specifies the Green (G) value</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>BLUE</name>
                <description>Specifies the Blue (B) value</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Specifies the Alpha (A) value</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
