ankuns/nrfx/bsp/stable/mdk/nrf7140_ml.svd
          <register>
            <name>AUTOCMDSTATR</name>
            <description>Unspecified</description>
            <addressOffset>0x03C</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <dataType>uint16_t</dataType>
            <size>0x10</size>
            <fields>
              <field>
                <name>AUTOCMD12NOTEXEC</name>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Executed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Not Executed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTOCMDTOUTERR</name>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>No Error</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Time out</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTOCMDCRCERR</name>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>No Error</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>CRC Error Generated</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTOCMDEBITERR</name>
                <lsb>3</lsb>
                <msb>3</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>No Error</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>End Bit Error Generated</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTOCMDIDXERR</name>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>No Error</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Error</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTOCMDRESPERR</name>
                <lsb>5</lsb>
                <msb>5</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>No Error</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Error</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RSVD6</name>
                <description>This bit of the AUTO_CMD_STAR_R register is reserved. It always returns 0.</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CMDNOTISSUEDAUTOCMD12</name>
                <lsb>7</lsb>
                <msb>7</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>No Error</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Not Issued</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RSVD158</name>
                <description>These bits of the AUTO_CMD_STAT_R register are reserved bits. They always return 0.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HOSTCTRL2R</name>
            <description>Unspecified</description>
            <addressOffset>0x03E</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <dataType>uint16_t</dataType>
            <size>0x10</size>
            <fields>
              <field>
                <name>UHSMODESEL</name>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SDR12</name>
                    <description>SDR12/Legacy</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SDR25</name>
                    <description>SDR25/High Speed SDR</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SDR50</name>
                    <description>SDR50</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SDR104</name>
                    <description>SDR104/HS200</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DDR50</name>
                    <description>DDR50/High Speed DDR</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RSVD5</name>
                    <description>Unspecified</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RSVD6</name>
                    <description>Unspecified</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UHS2</name>
                    <description>UHS-II/HS400</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SIGNALINGEN</name>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>V33</name>
                    <description>3.3V Signalling</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>V18</name>
                    <description>1.8V Signalling</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DRVSTRENGTHSEL</name>
                <lsb>4</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TYPEB</name>
                    <description>Driver TYPEB is selected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TYPEA</name>
                    <description>Driver TYPEA is selected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TYPEC</name>
                    <description>Driver TYPEC is selected</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TYPED</name>
                    <description>Driver TYPED is selected</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EXECTUNING</name>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Not Tuned or Tuning completed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Execute Tuning</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SAMPLECLKSEL</name>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Fixed clock is used to sample data</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Tuned clock is used to sample data</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>UHS2IFENABLE</name>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>SD/eMMC Interface Enabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>UHS-II Interface Enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RSVD9</name>
                <description>This bit of the HOST_CTRL2_R register is reserved. It always returns 0.</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ADMA2LENMODE</name>
                <lsb>10</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>16-bit Data Length Mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>26-bit Data Length Mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CMD23ENABLE</name>
                <lsb>11</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Auto CMD23 is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Auto CMD23 is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HOSTVER4ENABLE</name>
                <lsb>12</lsb>
                <msb>12</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Version 3.00 compatible mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Version 4 mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ADDRESSING</name>
                <lsb>13</lsb>
                <msb>13</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>32 bits addressing</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>64 bits addressing</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ASYNCINTENABLE</name>
                <lsb>14</lsb>
                <msb>14</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PRESETVALENABLE</name>
                <lsb>15</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>SDCLK and Driver Strength are controlled by Host Driver</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Automatic Selection by Preset Value are Enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
