ankuns/nrfx/bsp/stable/mdk/nrf7140_ml.svd
          <register>
            <name>URRCAPABILITIES1R</name>
            <description>This register indicate the maximum current capability for each voltage, for VDD1. The value is meaningful if the Voltage Support is set in the Capabilities</description>
            <addressOffset>0x048</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MAXCUR33V</name>
                <description>Maximum Current for 3.3V</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>MAXCUR30V</name>
                <description>Maximum Current for 3.0V</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>MAXCUR18V</name>
                <description>Maximum Current for 1.8V</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>RSVD3124</name>
                <description>These bits of the CURR_CAPABILITIES1_R register are reserved. They always return 0.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>URRCAPABILITIES2R</name>
            <description>This register indicates the maximum current capability for each voltage (for VDD2). The value is meaningful if Voltage Support is set in the Capabilities</description>
            <addressOffset>0x04C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MAXCURVDD218V</name>
                <description>Maximum Current for 1.8V VDD2</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>RSVD6340</name>
                <description>These bits of the CURR_CAPABILITIES2_R register are reserved. They always return 0.</description>
                <lsb>8</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FORCEAUTOCMDSTATR</name>
            <description>Unspecified</description>
            <addressOffset>0x050</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <dataType>uint16_t</dataType>
            <size>0x10</size>
            <fields>
              <field>
                <name>FORCEAUTOCMD12NOTEXEC</name>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Not Affected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Auto CMD12 Not Executed Status is set</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FORCEAUTOCMDTOUTERR</name>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Not Affected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Auto CMD Timeout Error Status is set</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FORCEAUTOCMDCRCERR</name>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Not Affected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Auto CMD CRC Error Status is set</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FORCEAUTOCMDEBITERR</name>
                <lsb>3</lsb>
                <msb>3</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Not Affected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Auto CMD End Bit Error Status is set</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FORCEAUTOCMDIDXERR</name>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Not Affected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Auto CMD Index Error Status is set</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FORCEAUTOCMDRESPERR</name>
                <lsb>5</lsb>
                <msb>5</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Not Affected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Auto CMD Response Error Status is set</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RSVD6</name>
                <description>This bit of the FORCE_AUTO_CMD_STAT_R register are reserved. They always return 0.</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>FORCECMDNOTISSUEDAUTOCMD12</name>
                <description>Force Event for Command Not Issued By Auto CMD12 Error</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Not Affected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Command Not Issued By Auto CMD12 Error Status is set</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RSVD158</name>
                <description>These bits of the FORCE_AUTO_CMD_STAT_R register are reserved. They always return 0.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FORCEERRORINTSTATR</name>
            <description>This register is not physically implemented but is an address at which the Error Interrupt Status register can be written. The effect of a write to this</description>
            <addressOffset>0x052</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <dataType>uint16_t</dataType>
            <size>0x10</size>
            <fields>
              <field>
                <name>FORCECMDTOUTERR</name>
                <description>Force Event for Command Timeout Error (SD/eMMC Mode only)</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Not Affected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Command Timeout Error  Status is set</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FORCECMDCRCERR</name>
                <description>Force Event for Command CRC Error (SD/eMMC Mode only)</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Not Affected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Command CRC Error  Status is set</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FORCECMDENDBITERR</name>
                <description>Force Event for Command End Bit Error (SD/eMMC Mode only)</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Not Affected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Command End Bit Error  Status is set</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FORCECMDIDXERR</name>
                <description>Force Event for Command Index Error (SD/eMMC Mode only)</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Not Affected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Command Index Error  Status is set</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FORCEDATATOUTERR</name>
                <description>Force Event for Data Timeout Error (SD/eMMC Mode only)</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Not Affected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Data Timeout Error  Status is set</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FORCEDATACRCERR</name>
                <description>Force Event for Data CRC Error (SD/eMMC Mode only)</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Not Affected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Data CRC Error  Status is set</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FORCEDATAENDBITERR</name>
                <description>Force Event for Data End Bit Error (SD/eMMC Mode only)</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Not Affected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Data End Bit Error  Status is set</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FORCECURLMTERR</name>
                <description>Force Event for Current Limit Error</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Not Affected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Current Limit Error  Status is set</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FORCEAUTOCMDERR</name>
                <description>Force Event for Auto CMD Error (SD/eMMC Mode only)</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Not Affected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Auto CMD Error  Status is set</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FORCEADMAERR</name>
                <description>Force Event for ADMA Error</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Not Affected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>ADMA  Error  Status is set</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FORCETUNINGERR</name>
                <description>Force Event for Tuning Error (UHS-I Mode only)</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Not Affected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Tuning Error  Status is set</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FORCERESPERR</name>
                <description>Force Event for Response Error (SD Mode only)</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Not Affected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Response Error  Status is set</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FORCEBOOTACKERR</name>
                <description>Force Event for Boot Ack error</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Not Affected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Boot ack Error Status is set</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FORCEVENDORERR1</name>
                <description>This bit (FORCE_VENDOR_ERR1) of the FORCE_ERROR_INT_STAT_R register is reserved. It always returns 0.</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>FORCEVENDORERR2</name>
                <description>This bit (FORCE_VENDOR_ERR2) of the FORCE_ERROR_INT_STAT_R register is reserved. It always returns 0.</description>
                <lsb>14</lsb>
                <msb>14</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>FORCEVENDORERR3</name>
                <description>This bit (FORCE_VENDOR_ERR3) of the FORCE_ERROR_INT_STAT_R register is reserved. It always returns 0.</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ADMAERRSTATR</name>
            <description>Unspecified</description>
            <addressOffset>0x054</addressOffset>
            <access>read-write</access>
            <resetValue>0x00</resetValue>
            <dataType>uint8_t</dataType>
            <size>0x8</size>
            <fields>
              <field>
                <name>ADMAERRSTATES</name>
                <lsb>0</lsb>
                <msb>1</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>STSTOP</name>
                    <description>Stop DMA - SYS_ADR register points to a location next to the error descriptor</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STFDS</name>
                    <description>Fetch Descriptor - SYS_ADR register points to the error descriptor</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UNUSED</name>
                    <description>Never set this state</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STTFR</name>
                    <description>Transfer Data - SYS_ADR register points to a location next to the error descriptor</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ADMALENERR</name>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOERR</name>
                    <description>No Error</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ERROR</name>
                    <description>Error</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RSVD73</name>
                <description>These bits of the ADMA_ERR_STAT_R register are reserved. They always return 0.</description>
                <lsb>3</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ADMASALOWR</name>
            <description>Unspecified</description>
            <addressOffset>0x058</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADMASALOW</name>
                <description>ADMA System Address</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
