ankuns/nrfx/bsp/stable/mdk/nrf7140_ml.svd
          <register>
            <name>MSHCCTRLR</name>
            <description>This register is used to control the operation of MSHC Host Controller.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x01</resetValue>
            <dataType>uint8_t</dataType>
            <size>0x8</size>
            <fields>
              <field>
                <name>CMDCONFLICTCHECK</name>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLECMDCONFLICTCHK</name>
                    <description>Disable command conflict check</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CMDCONFLICTCHKLAT1</name>
                    <description>Check for command conflict after 1 card clock cycle</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RSVD1</name>
                <description>These bits (RSVD1) of the MSHC_CTRL_R register are reserved. They always return 0.</description>
                <lsb>2</lsb>
                <msb>3</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>SWCGDIS</name>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>Internal clock gates are active and clock gating is controlled internally</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>Internal clock gating is disabled, clocks are not gated internally</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MBIUCTRLR</name>
            <description>This register is used to select the valid burst types that the AHB Manager bus interface can generate.</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x0F</resetValue>
            <dataType>uint8_t</dataType>
            <size>0x8</size>
            <fields>
              <field>
                <name>UNDEFLINCREN</name>
                <description>Undefined INCR Burst</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Undefined INCR type burst is the least preferred burst on AHB Manager I/F</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Undefined INCR type burst is the most preferred burst on AHB Manager I/F</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BURSTINCR4EN</name>
                <description>INCR4 Burst</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>AHB INCR4 burst type is not generated on Manager I/F</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>AHB INCR4 burst type can be generated on Manager I/F</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BURSTINCR8EN</name>
                <description>INCR8 Burst</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>AHB INCR8 burst type is not generated on Manager I/F</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>AHB INCR8 burst type can be generated on Manager I/F</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BURSTINCR16EN</name>
                <description>INCR16 Burst</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>AHB INCR16 burst type is not generated on Manager I/F</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>AHB INCR16 burst type can be generated on Manager I/F</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RSVD</name>
                <lsb>4</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>EMMCCTRLR</name>
            <description>This register is used to control the eMMC operation.</description>
            <addressOffset>0x02C</addressOffset>
            <access>read-write</access>
            <resetValue>0x000C</resetValue>
            <dataType>uint16_t</dataType>
            <size>0x10</size>
            <fields>
              <field>
                <name>CARDISEMMC</name>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NONEMMCCARD</name>
                    <description>Card connected to MSHC is a non-eMMC card</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EMMCCARD</name>
                    <description>Card connected to MSHC is an eMMC card</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DISABLEDATACRCCHK</name>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>DATA CRC check is enabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>DATA CRC check is disabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EMMCRSTN</name>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>RSTASSERT</name>
                    <description>Reset to eMMC device asserted (active low)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RSTDEASSERT</name>
                    <description>Reset to eMMC device is deasserted</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EMMCRSTNOE</name>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>sd_rst_n_oe is 0</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>sd_rst_n_oe is 1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RSVD</name>
                <description>These bits (RSVD) of the EMMC_CTRL_R register are reserved. They always return 0.</description>
                <lsb>11</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TCTRLR</name>
            <description>This register is used to control the eMMC Boot operation.</description>
            <addressOffset>0x02E</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <dataType>uint16_t</dataType>
            <size>0x10</size>
            <fields>
              <field>
                <name>MANBOOTEN</name>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MANBOOTDIS</name>
                    <description>Mandatory boot disable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MANBOOTEN</name>
                    <description>Mandatory boot enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RSVD61</name>
                <description>These bits (RSVD _6_1) of the BOOT_CTRL_R register are reserved. They always return 0.</description>
                <lsb>1</lsb>
                <msb>6</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>VALIDATEBOOT</name>
                <lsb>7</lsb>
                <msb>7</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Ignore Mandatory boot Enable bit</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Validate Mandatory boot enable bit</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BOOTACKENABLE</name>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Boot Ack disable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Boot Ack enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RSVD119</name>
                <description>These bits (RSVD_11_9) of the BOOT_CTRL_R register are reserved. They always return 0.</description>
                <lsb>9</lsb>
                <msb>11</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BOOTTOUTCNT</name>
                <lsb>12</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ATCTRLR</name>
            <description>This register controls some aspects of tuning and auto-tuning features. Do not program this register when HOST_CTRL2_R.SAMPLE_CLK_SEL is '1'</description>
            <addressOffset>0x040</addressOffset>
            <access>read-write</access>
            <resetValue>0x1F000005</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ATEN</name>
                <description>Setting this bit enables Auto tuning engine. This bit is enabled by default when core is configured with mode3 retuning support. Clear this bit to 0 when core is configured to have Mode3 re-tuning but SW wishes to disable mode3 re-tuning.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ATDISABLE</name>
                    <description>AutoTuning is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ATENABLE</name>
                    <description>AutoTuning is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CISEL</name>
                <description>Selects the interval when the corrected center phase select code can be driven on tuning_cclk_sel output.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>WHENINBLKGAP</name>
                    <description>Driven in block gap interval</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>WHENINIDLE</name>
                    <description>Driven at the end of the transfer</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SWINTHEN</name>
                <description>Sampling window Threshold enable</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LARGESTWINMODE</name>
                    <description>Tuning engine sweeps all taps and settles at the largest window</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>THRESHOLDMODE</name>
                    <description>Tuning engine selects the first complete sampling window that meets the threshold set by SWIN_TH_VAL field</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RPTTUNEERR</name>
                <description>Framing errors are not generated when executing tuning. This debug bit allows users to report these errors.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ERRORSDISABLED</name>
                    <description>Default mode where as per SD-HCI no errors are reported.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DEBUGERRORS</name>
                    <description>Debug mode for reporting framing errors</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SWTUNEEN</name>
                <description>This fields enables software-managed tuning flow.</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SWTUNINGDISABLE</name>
                    <description>Software-managed tuning disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SWTUNINGENABLE</name>
                    <description>Software-managed tuning enabled. AT_STAT_R.CENTER_PH_CODE Field is now writable.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RSDV2</name>
                <description>These bits (RSVD2) of the AT_CTRL_R register are reserved. They always return 0.</description>
                <lsb>5</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>WINEDGESEL</name>
                <description>This field sets the phase for Left and Right edges for drift monitoring. [Left edge offset + Right edge offset] must not be less than total taps of delayLine.</description>
                <lsb>8</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>RSDV3</name>
                <description>These bits (RSVD3) of the AT_CTRL_R register are reserved. They always return 0.</description>
                <lsb>12</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>TUNECLKSTOPEN</name>
                <description>Clock stopping control for Tuning and auto-tuning circuit.</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLECLKSTOPPING</name>
                    <description>Clocks not stopped. PHY ensures glitch free phase switching.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLECLKSTOPPING</name>
                    <description>Clocks stopped during phase code change</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PRECHANGEDLY</name>
                <description>Maximum Latency specification between cclk_tx and cclk_rx.</description>
                <lsb>17</lsb>
                <msb>18</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LATENCYLT1</name>
                    <description>Less than 1-cycle latency</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LATENCYLT2</name>
                    <description>Less than 2-cycle latency</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LATENCYLT3</name>
                    <description>Less than 3-cycle latency</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LATENCYLT4</name>
                    <description>Less than 4-cycle latency</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>POSTCHANGEDLY</name>
                <description>Time taken for phase switching and stable clock output.</description>
                <lsb>19</lsb>
                <msb>20</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LATENCYLT1</name>
                    <description>Less than 1-cycle latency</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LATENCYLT2</name>
                    <description>Less than 2-cycle latency</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LATENCYLT3</name>
                    <description>Less than 3-cycle latency</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LATENCYLT4</name>
                    <description>Less than 4-cycle latency</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SWINTHVAL</name>
                <description>Sampling window threshold value setting</description>
                <lsb>24</lsb>
                <msb>30</msb>
              </field>
            </fields>
          </register>
